markqvist/MicroAPRS/bertos/cpu/cortex-m3/io/lm3s_com.h
/**
 * \file
 * <!--
 * This file is part of BeRTOS.
 *
 * Bertos is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
 *
 * As a special exception, you may use this file as part of a free software
 * library without restriction.  Specifically, if other files instantiate
 * templates or use macros or inline functions from this file, or you compile
 * this file and link it with other files to produce an executable, this
 * file does not by itself cause the resulting executable to be covered by
 * the GNU General Public License.  This exception does not however
 * invalidate any other reasons why the executable file might be covered by
 * the GNU General Public License.
 *
 * Copyright 2010 Develer S.r.l. (http://www.develer.com/)
 *
 * -->
 *
 * \brief LM3S1968 registers definition.
 */

#ifndef LM3S1968_H
#define LM3S1968_H

#include <cfg/compiler.h>

/**
 * Watchdog Timer registers (WATCHDOG0)
 */
/*\{*/
#define WATCHDOG0_LOAD_R        (*((reg32_t *)0x40000000))
#define WATCHDOG0_VALUE_R       (*((reg32_t *)0x40000004))
#define WATCHDOG0_CTL_R         (*((reg32_t *)0x40000008))
#define WATCHDOG0_ICR_R         (*((reg32_t *)0x4000000C))
#define WATCHDOG0_RIS_R         (*((reg32_t *)0x40000010))
#define WATCHDOG0_MIS_R         (*((reg32_t *)0x40000014))
#define WATCHDOG0_TEST_R        (*((reg32_t *)0x40000418))
#define WATCHDOG0_LOCK_R        (*((reg32_t *)0x40000C00))
/*\}*/

/**
 * GPIO registers (PORTA)
 */
/*\{*/
#define GPIO_PORTA_DATA_BITS_R  ((reg32_t *)0x40004000)
#define GPIO_PORTA_DATA_R       (*((reg32_t *)0x400043FC))
#define GPIO_PORTA_DIR_R        (*((reg32_t *)0x40004400))
#define GPIO_PORTA_IS_R         (*((reg32_t *)0x40004404))
#define GPIO_PORTA_IBE_R        (*((reg32_t *)0x40004408))
#define GPIO_PORTA_IEV_R        (*((reg32_t *)0x4000440C))
#define GPIO_PORTA_IM_R         (*((reg32_t *)0x40004410))
#define GPIO_PORTA_RIS_R        (*((reg32_t *)0x40004414))
#define GPIO_PORTA_MIS_R        (*((reg32_t *)0x40004418))
#define GPIO_PORTA_ICR_R        (*((reg32_t *)0x4000441C))
#define GPIO_PORTA_AFSEL_R      (*((reg32_t *)0x40004420))
#define GPIO_PORTA_DR2R_R       (*((reg32_t *)0x40004500))
#define GPIO_PORTA_DR4R_R       (*((reg32_t *)0x40004504))
#define GPIO_PORTA_DR8R_R       (*((reg32_t *)0x40004508))
#define GPIO_PORTA_ODR_R        (*((reg32_t *)0x4000450C))
#define GPIO_PORTA_PUR_R        (*((reg32_t *)0x40004510))
#define GPIO_PORTA_PDR_R        (*((reg32_t *)0x40004514))
#define GPIO_PORTA_SLR_R        (*((reg32_t *)0x40004518))
#define GPIO_PORTA_DEN_R        (*((reg32_t *)0x4000451C))
#define GPIO_PORTA_LOCK_R       (*((reg32_t *)0x40004520))
#define GPIO_PORTA_CR_R         (*((reg32_t *)0x40004524))
/*\}*/

/**
 * GPIO registers (PORTB)
 */
/*\{*/
#define GPIO_PORTB_DATA_BITS_R  ((reg32_t *)0x40005000)
#define GPIO_PORTB_DATA_R       (*((reg32_t *)0x400053FC))
#define GPIO_PORTB_DIR_R        (*((reg32_t *)0x40005400))
#define GPIO_PORTB_IS_R         (*((reg32_t *)0x40005404))
#define GPIO_PORTB_IBE_R        (*((reg32_t *)0x40005408))
#define GPIO_PORTB_IEV_R        (*((reg32_t *)0x4000540C))
#define GPIO_PORTB_IM_R         (*((reg32_t *)0x40005410))
#define GPIO_PORTB_RIS_R        (*((reg32_t *)0x40005414))
#define GPIO_PORTB_MIS_R        (*((reg32_t *)0x40005418))
#define GPIO_PORTB_ICR_R        (*((reg32_t *)0x4000541C))
#define GPIO_PORTB_AFSEL_R      (*((reg32_t *)0x40005420))
#define GPIO_PORTB_DR2R_R       (*((reg32_t *)0x40005500))
#define GPIO_PORTB_DR4R_R       (*((reg32_t *)0x40005504))
#define GPIO_PORTB_DR8R_R       (*((reg32_t *)0x40005508))
#define GPIO_PORTB_ODR_R        (*((reg32_t *)0x4000550C))
#define GPIO_PORTB_PUR_R        (*((reg32_t *)0x40005510))
#define GPIO_PORTB_PDR_R        (*((reg32_t *)0x40005514))
#define GPIO_PORTB_SLR_R        (*((reg32_t *)0x40005518))
#define GPIO_PORTB_DEN_R        (*((reg32_t *)0x4000551C))
#define GPIO_PORTB_LOCK_R       (*((reg32_t *)0x40005520))
#define GPIO_PORTB_CR_R         (*((reg32_t *)0x40005524))
/*\}*/

/**
 * GPIO registers (PORTC)
 */
/*\{*/
#define GPIO_PORTC_DATA_BITS_R  ((reg32_t *)0x40006000)
#define GPIO_PORTC_DATA_R       (*((reg32_t *)0x400063FC))
#define GPIO_PORTC_DIR_R        (*((reg32_t *)0x40006400))
#define GPIO_PORTC_IS_R         (*((reg32_t *)0x40006404))
#define GPIO_PORTC_IBE_R        (*((reg32_t *)0x40006408))
#define GPIO_PORTC_IEV_R        (*((reg32_t *)0x4000640C))
#define GPIO_PORTC_IM_R         (*((reg32_t *)0x40006410))
#define GPIO_PORTC_RIS_R        (*((reg32_t *)0x40006414))
#define GPIO_PORTC_MIS_R        (*((reg32_t *)0x40006418))
#define GPIO_PORTC_ICR_R        (*((reg32_t *)0x4000641C))
#define GPIO_PORTC_AFSEL_R      (*((reg32_t *)0x40006420))
#define GPIO_PORTC_DR2R_R       (*((reg32_t *)0x40006500))
#define GPIO_PORTC_DR4R_R       (*((reg32_t *)0x40006504))
#define GPIO_PORTC_DR8R_R       (*((reg32_t *)0x40006508))
#define GPIO_PORTC_ODR_R        (*((reg32_t *)0x4000650C))
#define GPIO_PORTC_PUR_R        (*((reg32_t *)0x40006510))
#define GPIO_PORTC_PDR_R        (*((reg32_t *)0x40006514))
#define GPIO_PORTC_SLR_R        (*((reg32_t *)0x40006518))
#define GPIO_PORTC_DEN_R        (*((reg32_t *)0x4000651C))
#define GPIO_PORTC_LOCK_R       (*((reg32_t *)0x40006520))
#define GPIO_PORTC_CR_R         (*((reg32_t *)0x40006524))
/*\}*/

/**
 * GPIO registers (PORTD)
 */
/*\{*/
#define GPIO_PORTD_DATA_BITS_R  ((reg32_t *)0x40007000)
#define GPIO_PORTD_DATA_R       (*((reg32_t *)0x400073FC))
#define GPIO_PORTD_DIR_R        (*((reg32_t *)0x40007400))
#define GPIO_PORTD_IS_R         (*((reg32_t *)0x40007404))
#define GPIO_PORTD_IBE_R        (*((reg32_t *)0x40007408))
#define GPIO_PORTD_IEV_R        (*((reg32_t *)0x4000740C))
#define GPIO_PORTD_IM_R         (*((reg32_t *)0x40007410))
#define GPIO_PORTD_RIS_R        (*((reg32_t *)0x40007414))
#define GPIO_PORTD_MIS_R        (*((reg32_t *)0x40007418))
#define GPIO_PORTD_ICR_R        (*((reg32_t *)0x4000741C))
#define GPIO_PORTD_AFSEL_R      (*((reg32_t *)0x40007420))
#define GPIO_PORTD_DR2R_R       (*((reg32_t *)0x40007500))
#define GPIO_PORTD_DR4R_R       (*((reg32_t *)0x40007504))
#define GPIO_PORTD_DR8R_R       (*((reg32_t *)0x40007508))
#define GPIO_PORTD_ODR_R        (*((reg32_t *)0x4000750C))
#define GPIO_PORTD_PUR_R        (*((reg32_t *)0x40007510))
#define GPIO_PORTD_PDR_R        (*((reg32_t *)0x40007514))
#define GPIO_PORTD_SLR_R        (*((reg32_t *)0x40007518))
#define GPIO_PORTD_DEN_R        (*((reg32_t *)0x4000751C))
#define GPIO_PORTD_LOCK_R       (*((reg32_t *)0x40007520))
#define GPIO_PORTD_CR_R         (*((reg32_t *)0x40007524))
/*\}*/

/**
 * SSI registers (SSI0)
 */
/*\{*/
#define SSI0_CR0_R              (*((reg32_t *)0x40008000))
#define SSI0_CR1_R              (*((reg32_t *)0x40008004))
#define SSI0_DR_R               (*((reg32_t *)0x40008008))
#define SSI0_SR_R               (*((reg32_t *)0x4000800C))
#define SSI0_CPSR_R             (*((reg32_t *)0x40008010))
#define SSI0_IM_R               (*((reg32_t *)0x40008014))
#define SSI0_RIS_R              (*((reg32_t *)0x40008018))
#define SSI0_MIS_R              (*((reg32_t *)0x4000801C))
#define SSI0_ICR_R              (*((reg32_t *)0x40008020))
/*\}*/

/**
 * SSI registers (SSI1)
 */
/*\{*/
#define SSI1_CR0_R              (*((reg32_t *)0x40009000))
#define SSI1_CR1_R              (*((reg32_t *)0x40009004))
#define SSI1_DR_R               (*((reg32_t *)0x40009008))
#define SSI1_SR_R               (*((reg32_t *)0x4000900C))
#define SSI1_CPSR_R             (*((reg32_t *)0x40009010))
#define SSI1_IM_R               (*((reg32_t *)0x40009014))
#define SSI1_RIS_R              (*((reg32_t *)0x40009018))
#define SSI1_MIS_R              (*((reg32_t *)0x4000901C))
#define SSI1_ICR_R              (*((reg32_t *)0x40009020))
/*\}*/

/**
 * UART registers (UART0)
 */
/*\{*/
#define UART0_DR_R              (*((reg32_t *)0x4000C000))
#define UART0_RSR_R             (*((reg32_t *)0x4000C004))
#define UART0_ECR_R             (*((reg32_t *)0x4000C004))
#define UART0_FR_R              (*((reg32_t *)0x4000C018))
#define UART0_ILPR_R            (*((reg32_t *)0x4000C020))
#define UART0_IBRD_R            (*((reg32_t *)0x4000C024))
#define UART0_FBRD_R            (*((reg32_t *)0x4000C028))
#define UART0_LCRH_R            (*((reg32_t *)0x4000C02C))
#define UART0_CTL_R             (*((reg32_t *)0x4000C030))
#define UART0_IFLS_R            (*((reg32_t *)0x4000C034))
#define UART0_IM_R              (*((reg32_t *)0x4000C038))
#define UART0_RIS_R             (*((reg32_t *)0x4000C03C))
#define UART0_MIS_R             (*((reg32_t *)0x4000C040))
#define UART0_ICR_R             (*((reg32_t *)0x4000C044))
/*\}*/

/**
 * UART registers (UART1)
 */
/*\{*/
#define UART1_DR_R              (*((reg32_t *)0x4000D000))
#define UART1_RSR_R             (*((reg32_t *)0x4000D004))
#define UART1_ECR_R             (*((reg32_t *)0x4000D004))
#define UART1_FR_R              (*((reg32_t *)0x4000D018))
#define UART1_ILPR_R            (*((reg32_t *)0x4000D020))
#define UART1_IBRD_R            (*((reg32_t *)0x4000D024))
#define UART1_FBRD_R            (*((reg32_t *)0x4000D028))
#define UART1_LCRH_R            (*((reg32_t *)0x4000D02C))
#define UART1_CTL_R             (*((reg32_t *)0x4000D030))
#define UART1_IFLS_R            (*((reg32_t *)0x4000D034))
#define UART1_IM_R              (*((reg32_t *)0x4000D038))
#define UART1_RIS_R             (*((reg32_t *)0x4000D03C))
#define UART1_MIS_R             (*((reg32_t *)0x4000D040))
#define UART1_ICR_R             (*((reg32_t *)0x4000D044))
/*\}*/

/**
 * UART registers (UART2)
 */
/*\{*/
#define UART2_DR_R              (*((reg32_t *)0x4000E000))
#define UART2_RSR_R             (*((reg32_t *)0x4000E004))
#define UART2_ECR_R             (*((reg32_t *)0x4000E004))
#define UART2_FR_R              (*((reg32_t *)0x4000E018))
#define UART2_ILPR_R            (*((reg32_t *)0x4000E020))
#define UART2_IBRD_R            (*((reg32_t *)0x4000E024))
#define UART2_FBRD_R            (*((reg32_t *)0x4000E028))
#define UART2_LCRH_R            (*((reg32_t *)0x4000E02C))
#define UART2_CTL_R             (*((reg32_t *)0x4000E030))
#define UART2_IFLS_R            (*((reg32_t *)0x4000E034))
#define UART2_IM_R              (*((reg32_t *)0x4000E038))
#define UART2_RIS_R             (*((reg32_t *)0x4000E03C))
#define UART2_MIS_R             (*((reg32_t *)0x4000E040))
#define UART2_ICR_R             (*((reg32_t *)0x4000E044))
/*\}*/

/**
 * I2C registers (I2C0 MASTER)
 */
/*\{*/
#define I2C0_MASTER_MSA_R       (*((reg32_t *)0x40020000))
#define I2C0_MASTER_SOAR_R      (*((reg32_t *)0x40020000))
#define I2C0_MASTER_SCSR_R      (*((reg32_t *)0x40020004))
#define I2C0_MASTER_MCS_R       (*((reg32_t *)0x40020004))
#define I2C0_MASTER_SDR_R       (*((reg32_t *)0x40020008))
#define I2C0_MASTER_MDR_R       (*((reg32_t *)0x40020008))
#define I2C0_MASTER_MTPR_R      (*((reg32_t *)0x4002000C))
#define I2C0_MASTER_SIMR_R      (*((reg32_t *)0x4002000C))
#define I2C0_MASTER_SRIS_R      (*((reg32_t *)0x40020010))
#define I2C0_MASTER_MIMR_R      (*((reg32_t *)0x40020010))
#define I2C0_MASTER_MRIS_R      (*((reg32_t *)0x40020014))
#define I2C0_MASTER_SMIS_R      (*((reg32_t *)0x40020014))
#define I2C0_MASTER_SICR_R      (*((reg32_t *)0x40020018))
#define I2C0_MASTER_MMIS_R      (*((reg32_t *)0x40020018))
#define I2C0_MASTER_MICR_R      (*((reg32_t *)0x4002001C))
#define I2C0_MASTER_MCR_R       (*((reg32_t *)0x40020020))
/*\}*/

/**
 * I2C registers (I2C0 SLAVE)
 */
/*\{*/
#define I2C0_SLAVE_MSA_R        (*((reg32_t *)0x40020800))
#define I2C0_SLAVE_SOAR_R       (*((reg32_t *)0x40020800))
#define I2C0_SLAVE_SCSR_R       (*((reg32_t *)0x40020804))
#define I2C0_SLAVE_MCS_R        (*((reg32_t *)0x40020804))
#define I2C0_SLAVE_SDR_R        (*((reg32_t *)0x40020808))
#define I2C0_SLAVE_MDR_R        (*((reg32_t *)0x40020808))
#define I2C0_SLAVE_MTPR_R       (*((reg32_t *)0x4002080C))
#define I2C0_SLAVE_SIMR_R       (*((reg32_t *)0x4002080C))
#define I2C0_SLAVE_SRIS_R       (*((reg32_t *)0x40020810))
#define I2C0_SLAVE_MIMR_R       (*((reg32_t *)0x40020810))
#define I2C0_SLAVE_MRIS_R       (*((reg32_t *)0x40020814))
#define I2C0_SLAVE_SMIS_R       (*((reg32_t *)0x40020814))
#define I2C0_SLAVE_SICR_R       (*((reg32_t *)0x40020818))
#define I2C0_SLAVE_MMIS_R       (*((reg32_t *)0x40020818))
#define I2C0_SLAVE_MICR_R       (*((reg32_t *)0x4002081C))
#define I2C0_SLAVE_MCR_R        (*((reg32_t *)0x40020820))
/*\}*/

/**
 * I2C registers (I2C1 MASTER)
 */
/*\{*/
#define I2C1_MASTER_MSA_R       (*((reg32_t *)0x40021000))
#define I2C1_MASTER_SOAR_R      (*((reg32_t *)0x40021000))
#define I2C1_MASTER_SCSR_R      (*((reg32_t *)0x40021004))
#define I2C1_MASTER_MCS_R       (*((reg32_t *)0x40021004))
#define I2C1_MASTER_SDR_R       (*((reg32_t *)0x40021008))
#define I2C1_MASTER_MDR_R       (*((reg32_t *)0x40021008))
#define I2C1_MASTER_MTPR_R      (*((reg32_t *)0x4002100C))
#define I2C1_MASTER_SIMR_R      (*((reg32_t *)0x4002100C))
#define I2C1_MASTER_SRIS_R      (*((reg32_t *)0x40021010))
#define I2C1_MASTER_MIMR_R      (*((reg32_t *)0x40021010))
#define I2C1_MASTER_MRIS_R      (*((reg32_t *)0x40021014))
#define I2C1_MASTER_SMIS_R      (*((reg32_t *)0x40021014))
#define I2C1_MASTER_SICR_R      (*((reg32_t *)0x40021018))
#define I2C1_MASTER_MMIS_R      (*((reg32_t *)0x40021018))
#define I2C1_MASTER_MICR_R      (*((reg32_t *)0x4002101C))
#define I2C1_MASTER_MCR_R       (*((reg32_t *)0x40021020))
/*\}*/

/**
 * I2C registers (I2C1 SLAVE)
 */
/*\{*/
#define I2C1_SLAVE_MSA_R        (*((reg32_t *)0x40021800))
#define I2C1_SLAVE_SOAR_R       (*((reg32_t *)0x40021800))
#define I2C1_SLAVE_SCSR_R       (*((reg32_t *)0x40021804))
#define I2C1_SLAVE_MCS_R        (*((reg32_t *)0x40021804))
#define I2C1_SLAVE_SDR_R        (*((reg32_t *)0x40021808))
#define I2C1_SLAVE_MDR_R        (*((reg32_t *)0x40021808))
#define I2C1_SLAVE_MTPR_R       (*((reg32_t *)0x4002180C))
#define I2C1_SLAVE_SIMR_R       (*((reg32_t *)0x4002180C))
#define I2C1_SLAVE_SRIS_R       (*((reg32_t *)0x40021810))
#define I2C1_SLAVE_MIMR_R       (*((reg32_t *)0x40021810))
#define I2C1_SLAVE_MRIS_R       (*((reg32_t *)0x40021814))
#define I2C1_SLAVE_SMIS_R       (*((reg32_t *)0x40021814))
#define I2C1_SLAVE_SICR_R       (*((reg32_t *)0x40021818))
#define I2C1_SLAVE_MMIS_R       (*((reg32_t *)0x40021818))
#define I2C1_SLAVE_MICR_R       (*((reg32_t *)0x4002181C))
#define I2C1_SLAVE_MCR_R        (*((reg32_t *)0x40021820))
/*\}*/

/**
 * GPIO registers (PORTE)
 */
/*\{*/
#define GPIO_PORTE_DATA_BITS_R  ((reg32_t *)0x40024000)
#define GPIO_PORTE_DATA_R       (*((reg32_t *)0x400243FC))
#define GPIO_PORTE_DIR_R        (*((reg32_t *)0x40024400))
#define GPIO_PORTE_IS_R         (*((reg32_t *)0x40024404))
#define GPIO_PORTE_IBE_R        (*((reg32_t *)0x40024408))
#define GPIO_PORTE_IEV_R        (*((reg32_t *)0x4002440C))
#define GPIO_PORTE_IM_R         (*((reg32_t *)0x40024410))
#define GPIO_PORTE_RIS_R        (*((reg32_t *)0x40024414))
#define GPIO_PORTE_MIS_R        (*((reg32_t *)0x40024418))
#define GPIO_PORTE_ICR_R        (*((reg32_t *)0x4002441C))
#define GPIO_PORTE_AFSEL_R      (*((reg32_t *)0x40024420))
#define GPIO_PORTE_DR2R_R       (*((reg32_t *)0x40024500))
#define GPIO_PORTE_DR4R_R       (*((reg32_t *)0x40024504))
#define GPIO_PORTE_DR8R_R       (*((reg32_t *)0x40024508))
#define GPIO_PORTE_ODR_R        (*((reg32_t *)0x4002450C))
#define GPIO_PORTE_PUR_R        (*((reg32_t *)0x40024510))
#define GPIO_PORTE_PDR_R        (*((reg32_t *)0x40024514))
#define GPIO_PORTE_SLR_R        (*((reg32_t *)0x40024518))
#define GPIO_PORTE_DEN_R        (*((reg32_t *)0x4002451C))
#define GPIO_PORTE_LOCK_R       (*((reg32_t *)0x40024520))
#define GPIO_PORTE_CR_R         (*((reg32_t *)0x40024524))
/*\}*/

/**
 * GPIO registers (PORTF)
 */
/*\{*/
#define GPIO_PORTF_DATA_BITS_R  ((reg32_t *)0x40025000)
#define GPIO_PORTF_DATA_R       (*((reg32_t *)0x400253FC))
#define GPIO_PORTF_DIR_R        (*((reg32_t *)0x40025400))
#define GPIO_PORTF_IS_R         (*((reg32_t *)0x40025404))
#define GPIO_PORTF_IBE_R        (*((reg32_t *)0x40025408))
#define GPIO_PORTF_IEV_R        (*((reg32_t *)0x4002540C))
#define GPIO_PORTF_IM_R         (*((reg32_t *)0x40025410))
#define GPIO_PORTF_RIS_R        (*((reg32_t *)0x40025414))
#define GPIO_PORTF_MIS_R        (*((reg32_t *)0x40025418))
#define GPIO_PORTF_ICR_R        (*((reg32_t *)0x4002541C))
#define GPIO_PORTF_AFSEL_R      (*((reg32_t *)0x40025420))
#define GPIO_PORTF_DR2R_R       (*((reg32_t *)0x40025500))
#define GPIO_PORTF_DR4R_R       (*((reg32_t *)0x40025504))
#define GPIO_PORTF_DR8R_R       (*((reg32_t *)0x40025508))
#define GPIO_PORTF_ODR_R        (*((reg32_t *)0x4002550C))
#define GPIO_PORTF_PUR_R        (*((reg32_t *)0x40025510))
#define GPIO_PORTF_PDR_R        (*((reg32_t *)0x40025514))
#define GPIO_PORTF_SLR_R        (*((reg32_t *)0x40025518))
#define GPIO_PORTF_DEN_R        (*((reg32_t *)0x4002551C))
#define GPIO_PORTF_LOCK_R       (*((reg32_t *)0x40025520))
#define GPIO_PORTF_CR_R         (*((reg32_t *)0x40025524))
/*\}*/

/**
 * GPIO registers (PORTG)
 */
/*\{*/
#define GPIO_PORTG_DATA_BITS_R  ((reg32_t *)0x40026000)
#define GPIO_PORTG_DATA_R       (*((reg32_t *)0x400263FC))
#define GPIO_PORTG_DIR_R        (*((reg32_t *)0x40026400))
#define GPIO_PORTG_IS_R         (*((reg32_t *)0x40026404))
#define GPIO_PORTG_IBE_R        (*((reg32_t *)0x40026408))
#define GPIO_PORTG_IEV_R        (*((reg32_t *)0x4002640C))
#define GPIO_PORTG_IM_R         (*((reg32_t *)0x40026410))
#define GPIO_PORTG_RIS_R        (*((reg32_t *)0x40026414))
#define GPIO_PORTG_MIS_R        (*((reg32_t *)0x40026418))
#define GPIO_PORTG_ICR_R        (*((reg32_t *)0x4002641C))
#define GPIO_PORTG_AFSEL_R      (*((reg32_t *)0x40026420))
#define GPIO_PORTG_DR2R_R       (*((reg32_t *)0x40026500))
#define GPIO_PORTG_DR4R_R       (*((reg32_t *)0x40026504))
#define GPIO_PORTG_DR8R_R       (*((reg32_t *)0x40026508))
#define GPIO_PORTG_ODR_R        (*((reg32_t *)0x4002650C))
#define GPIO_PORTG_PUR_R        (*((reg32_t *)0x40026510))
#define GPIO_PORTG_PDR_R        (*((reg32_t *)0x40026514))
#define GPIO_PORTG_SLR_R        (*((reg32_t *)0x40026518))
#define GPIO_PORTG_DEN_R        (*((reg32_t *)0x4002651C))
#define GPIO_PORTG_LOCK_R       (*((reg32_t *)0x40026520))
#define GPIO_PORTG_CR_R         (*((reg32_t *)0x40026524))
/*\}*/

/**
 * GPIO registers (PORTH)
 */
/*\{*/
#define GPIO_PORTH_DATA_BITS_R  ((reg32_t *)0x40027000)
#define GPIO_PORTH_DATA_R       (*((reg32_t *)0x400273FC))
#define GPIO_PORTH_DIR_R        (*((reg32_t *)0x40027400))
#define GPIO_PORTH_IS_R         (*((reg32_t *)0x40027404))
#define GPIO_PORTH_IBE_R        (*((reg32_t *)0x40027408))
#define GPIO_PORTH_IEV_R        (*((reg32_t *)0x4002740C))
#define GPIO_PORTH_IM_R         (*((reg32_t *)0x40027410))
#define GPIO_PORTH_RIS_R        (*((reg32_t *)0x40027414))
#define GPIO_PORTH_MIS_R        (*((reg32_t *)0x40027418))
#define GPIO_PORTH_ICR_R        (*((reg32_t *)0x4002741C))
#define GPIO_PORTH_AFSEL_R      (*((reg32_t *)0x40027420))
#define GPIO_PORTH_DR2R_R       (*((reg32_t *)0x40027500))
#define GPIO_PORTH_DR4R_R       (*((reg32_t *)0x40027504))
#define GPIO_PORTH_DR8R_R       (*((reg32_t *)0x40027508))
#define GPIO_PORTH_ODR_R        (*((reg32_t *)0x4002750C))
#define GPIO_PORTH_PUR_R        (*((reg32_t *)0x40027510))
#define GPIO_PORTH_PDR_R        (*((reg32_t *)0x40027514))
#define GPIO_PORTH_SLR_R        (*((reg32_t *)0x40027518))
#define GPIO_PORTH_DEN_R        (*((reg32_t *)0x4002751C))
#define GPIO_PORTH_LOCK_R       (*((reg32_t *)0x40027520))
#define GPIO_PORTH_CR_R         (*((reg32_t *)0x40027524))
/*\}*/

/**
 * PWM registers (PWM)
 */
/*\{*/
#define PWM_CTL_R               (*((reg32_t *)0x40028000))
#define PWM_SYNC_R              (*((reg32_t *)0x40028004))
#define PWM_ENABLE_R            (*((reg32_t *)0x40028008))
#define PWM_INVERT_R            (*((reg32_t *)0x4002800C))
#define PWM_FAULT_R             (*((reg32_t *)0x40028010))
#define PWM_INTEN_R             (*((reg32_t *)0x40028014))
#define PWM_RIS_R               (*((reg32_t *)0x40028018))
#define PWM_ISC_R               (*((reg32_t *)0x4002801C))
#define PWM_STATUS_R            (*((reg32_t *)0x40028020))
#define PWM_0_CTL_R             (*((reg32_t *)0x40028040))
#define PWM_0_INTEN_R           (*((reg32_t *)0x40028044))
#define PWM_0_RIS_R             (*((reg32_t *)0x40028048))
#define PWM_0_ISC_R             (*((reg32_t *)0x4002804C))
#define PWM_0_LOAD_R            (*((reg32_t *)0x40028050))
#define PWM_0_COUNT_R           (*((reg32_t *)0x40028054))
#define PWM_0_CMPA_R            (*((reg32_t *)0x40028058))
#define PWM_0_CMPB_R            (*((reg32_t *)0x4002805C))
#define PWM_0_GENA_R            (*((reg32_t *)0x40028060))
#define PWM_0_GENB_R            (*((reg32_t *)0x40028064))
#define PWM_0_DBCTL_R           (*((reg32_t *)0x40028068))
#define PWM_0_DBRISE_R          (*((reg32_t *)0x4002806C))
#define PWM_0_DBFALL_R          (*((reg32_t *)0x40028070))
#define PWM_1_CTL_R             (*((reg32_t *)0x40028080))
#define PWM_1_INTEN_R           (*((reg32_t *)0x40028084))
#define PWM_1_RIS_R             (*((reg32_t *)0x40028088))
#define PWM_1_ISC_R             (*((reg32_t *)0x4002808C))
#define PWM_1_LOAD_R            (*((reg32_t *)0x40028090))
#define PWM_1_COUNT_R           (*((reg32_t *)0x40028094))
#define PWM_1_CMPA_R            (*((reg32_t *)0x40028098))
#define PWM_1_CMPB_R            (*((reg32_t *)0x4002809C))
#define PWM_1_GENA_R            (*((reg32_t *)0x400280A0))
#define PWM_1_GENB_R            (*((reg32_t *)0x400280A4))
#define PWM_1_DBCTL_R           (*((reg32_t *)0x400280A8))
#define PWM_1_DBRISE_R          (*((reg32_t *)0x400280AC))
#define PWM_1_DBFALL_R          (*((reg32_t *)0x400280B0))
#define PWM_2_CTL_R             (*((reg32_t *)0x400280C0))
#define PWM_2_INTEN_R           (*((reg32_t *)0x400280C4))
#define PWM_2_RIS_R             (*((reg32_t *)0x400280C8))
#define PWM_2_ISC_R             (*((reg32_t *)0x400280CC))
#define PWM_2_LOAD_R            (*((reg32_t *)0x400280D0))
#define PWM_2_COUNT_R           (*((reg32_t *)0x400280D4))
#define PWM_2_CMPA_R            (*((reg32_t *)0x400280D8))
#define PWM_2_CMPB_R            (*((reg32_t *)0x400280DC))
#define PWM_2_GENA_R            (*((reg32_t *)0x400280E0))
#define PWM_2_GENB_R            (*((reg32_t *)0x400280E4))
#define PWM_2_DBCTL_R           (*((reg32_t *)0x400280E8))
#define PWM_2_DBRISE_R          (*((reg32_t *)0x400280EC))
#define PWM_2_DBFALL_R          (*((reg32_t *)0x400280F0))
/*\}*/

/**
 * QEI registers (QEI0)
 */
/*\{*/
#define QEI0_CTL_R              (*((reg32_t *)0x4002C000))
#define QEI0_STAT_R             (*((reg32_t *)0x4002C004))
#define QEI0_POS_R              (*((reg32_t *)0x4002C008))
#define QEI0_MAXPOS_R           (*((reg32_t *)0x4002C00C))
#define QEI0_LOAD_R             (*((reg32_t *)0x4002C010))
#define QEI0_TIME_R             (*((reg32_t *)0x4002C014))
#define QEI0_COUNT_R            (*((reg32_t *)0x4002C018))
#define QEI0_SPEED_R            (*((reg32_t *)0x4002C01C))
#define QEI0_INTEN_R            (*((reg32_t *)0x4002C020))
#define QEI0_RIS_R              (*((reg32_t *)0x4002C024))
#define QEI0_ISC_R              (*((reg32_t *)0x4002C028))
/*\}*/

