markqvist/MicroAPRS/bertos/cpu/cortex-m3/io/lm3s_com.h
/**
 * QEI registers (QEI1)
 */
/*\{*/
#define QEI1_CTL_R              (*((reg32_t *)0x4002D000))
#define QEI1_STAT_R             (*((reg32_t *)0x4002D004))
#define QEI1_POS_R              (*((reg32_t *)0x4002D008))
#define QEI1_MAXPOS_R           (*((reg32_t *)0x4002D00C))
#define QEI1_LOAD_R             (*((reg32_t *)0x4002D010))
#define QEI1_TIME_R             (*((reg32_t *)0x4002D014))
#define QEI1_COUNT_R            (*((reg32_t *)0x4002D018))
#define QEI1_SPEED_R            (*((reg32_t *)0x4002D01C))
#define QEI1_INTEN_R            (*((reg32_t *)0x4002D020))
#define QEI1_RIS_R              (*((reg32_t *)0x4002D024))
#define QEI1_ISC_R              (*((reg32_t *)0x4002D028))
/*\}*/

/**
 * Timer registers (TIMER0)
 */
/*\{*/
#define TIMER0_CFG_R            (*((reg32_t *)0x40030000))
#define TIMER0_TAMR_R           (*((reg32_t *)0x40030004))
#define TIMER0_TBMR_R           (*((reg32_t *)0x40030008))
#define TIMER0_CTL_R            (*((reg32_t *)0x4003000C))
#define TIMER0_IMR_R            (*((reg32_t *)0x40030018))
#define TIMER0_RIS_R            (*((reg32_t *)0x4003001C))
#define TIMER0_MIS_R            (*((reg32_t *)0x40030020))
#define TIMER0_ICR_R            (*((reg32_t *)0x40030024))
#define TIMER0_TAILR_R          (*((reg32_t *)0x40030028))
#define TIMER0_TBILR_R          (*((reg32_t *)0x4003002C))
#define TIMER0_TAMATCHR_R       (*((reg32_t *)0x40030030))
#define TIMER0_TBMATCHR_R       (*((reg32_t *)0x40030034))
#define TIMER0_TAPR_R           (*((reg32_t *)0x40030038))
#define TIMER0_TBPR_R           (*((reg32_t *)0x4003003C))
#define TIMER0_TAPMR_R          (*((reg32_t *)0x40030040))
#define TIMER0_TBPMR_R          (*((reg32_t *)0x40030044))
#define TIMER0_TAR_R            (*((reg32_t *)0x40030048))
#define TIMER0_TBR_R            (*((reg32_t *)0x4003004C))
/*\}*/

/**
 * Timer registers (TIMER1)
 */
/*\{*/
#define TIMER1_CFG_R            (*((reg32_t *)0x40031000))
#define TIMER1_TAMR_R           (*((reg32_t *)0x40031004))
#define TIMER1_TBMR_R           (*((reg32_t *)0x40031008))
#define TIMER1_CTL_R            (*((reg32_t *)0x4003100C))
#define TIMER1_IMR_R            (*((reg32_t *)0x40031018))
#define TIMER1_RIS_R            (*((reg32_t *)0x4003101C))
#define TIMER1_MIS_R            (*((reg32_t *)0x40031020))
#define TIMER1_ICR_R            (*((reg32_t *)0x40031024))
#define TIMER1_TAILR_R          (*((reg32_t *)0x40031028))
#define TIMER1_TBILR_R          (*((reg32_t *)0x4003102C))
#define TIMER1_TAMATCHR_R       (*((reg32_t *)0x40031030))
#define TIMER1_TBMATCHR_R       (*((reg32_t *)0x40031034))
#define TIMER1_TAPR_R           (*((reg32_t *)0x40031038))
#define TIMER1_TBPR_R           (*((reg32_t *)0x4003103C))
#define TIMER1_TAPMR_R          (*((reg32_t *)0x40031040))
#define TIMER1_TBPMR_R          (*((reg32_t *)0x40031044))
#define TIMER1_TAR_R            (*((reg32_t *)0x40031048))
#define TIMER1_TBR_R            (*((reg32_t *)0x4003104C))
/*\}*/

/**
 * Timer registers (TIMER2)
 */
/*\{*/
#define TIMER2_CFG_R            (*((reg32_t *)0x40032000))
#define TIMER2_TAMR_R           (*((reg32_t *)0x40032004))
#define TIMER2_TBMR_R           (*((reg32_t *)0x40032008))
#define TIMER2_CTL_R            (*((reg32_t *)0x4003200C))
#define TIMER2_IMR_R            (*((reg32_t *)0x40032018))
#define TIMER2_RIS_R            (*((reg32_t *)0x4003201C))
#define TIMER2_MIS_R            (*((reg32_t *)0x40032020))
#define TIMER2_ICR_R            (*((reg32_t *)0x40032024))
#define TIMER2_TAILR_R          (*((reg32_t *)0x40032028))
#define TIMER2_TBILR_R          (*((reg32_t *)0x4003202C))
#define TIMER2_TAMATCHR_R       (*((reg32_t *)0x40032030))
#define TIMER2_TBMATCHR_R       (*((reg32_t *)0x40032034))
#define TIMER2_TAPR_R           (*((reg32_t *)0x40032038))
#define TIMER2_TBPR_R           (*((reg32_t *)0x4003203C))
#define TIMER2_TAPMR_R          (*((reg32_t *)0x40032040))
#define TIMER2_TBPMR_R          (*((reg32_t *)0x40032044))
#define TIMER2_TAR_R            (*((reg32_t *)0x40032048))
#define TIMER2_TBR_R            (*((reg32_t *)0x4003204C))
/*\}*/

/**
 * Timer registers (TIMER3)
 */
/*\{*/
#define TIMER3_CFG_R            (*((reg32_t *)0x40033000))
#define TIMER3_TAMR_R           (*((reg32_t *)0x40033004))
#define TIMER3_TBMR_R           (*((reg32_t *)0x40033008))
#define TIMER3_CTL_R            (*((reg32_t *)0x4003300C))
#define TIMER3_IMR_R            (*((reg32_t *)0x40033018))
#define TIMER3_RIS_R            (*((reg32_t *)0x4003301C))
#define TIMER3_MIS_R            (*((reg32_t *)0x40033020))
#define TIMER3_ICR_R            (*((reg32_t *)0x40033024))
#define TIMER3_TAILR_R          (*((reg32_t *)0x40033028))
#define TIMER3_TBILR_R          (*((reg32_t *)0x4003302C))
#define TIMER3_TAMATCHR_R       (*((reg32_t *)0x40033030))
#define TIMER3_TBMATCHR_R       (*((reg32_t *)0x40033034))
#define TIMER3_TAPR_R           (*((reg32_t *)0x40033038))
#define TIMER3_TBPR_R           (*((reg32_t *)0x4003303C))
#define TIMER3_TAPMR_R          (*((reg32_t *)0x40033040))
#define TIMER3_TBPMR_R          (*((reg32_t *)0x40033044))
#define TIMER3_TAR_R            (*((reg32_t *)0x40033048))
#define TIMER3_TBR_R            (*((reg32_t *)0x4003304C))
/*\}*/

/**
 * ADC registers (ADC0)
 */
/*\{*/
#define ADC0_ACTSS_R            (*((reg32_t *)0x40038000))
#define ADC0_RIS_R              (*((reg32_t *)0x40038004))
#define ADC0_IM_R               (*((reg32_t *)0x40038008))
#define ADC0_ISC_R              (*((reg32_t *)0x4003800C))
#define ADC0_OSTAT_R            (*((reg32_t *)0x40038010))
#define ADC0_EMUX_R             (*((reg32_t *)0x40038014))
#define ADC0_USTAT_R            (*((reg32_t *)0x40038018))
#define ADC0_SSPRI_R            (*((reg32_t *)0x40038020))
#define ADC0_PSSI_R             (*((reg32_t *)0x40038028))
#define ADC0_SAC_R              (*((reg32_t *)0x40038030))
#define ADC0_SSMUX0_R           (*((reg32_t *)0x40038040))
#define ADC0_SSCTL0_R           (*((reg32_t *)0x40038044))
#define ADC0_SSFIFO0_R          (*((reg32_t *)0x40038048))
#define ADC0_SSFSTAT0_R         (*((reg32_t *)0x4003804C))
#define ADC0_SSMUX1_R           (*((reg32_t *)0x40038060))
#define ADC0_SSCTL1_R           (*((reg32_t *)0x40038064))
#define ADC0_SSFIFO1_R          (*((reg32_t *)0x40038068))
#define ADC0_SSFSTAT1_R         (*((reg32_t *)0x4003806C))
#define ADC0_SSMUX2_R           (*((reg32_t *)0x40038080))
#define ADC0_SSCTL2_R           (*((reg32_t *)0x40038084))
#define ADC0_SSFIFO2_R          (*((reg32_t *)0x40038088))
#define ADC0_SSFSTAT2_R         (*((reg32_t *)0x4003808C))
#define ADC0_SSMUX3_R           (*((reg32_t *)0x400380A0))
#define ADC0_SSCTL3_R           (*((reg32_t *)0x400380A4))
#define ADC0_SSFIFO3_R          (*((reg32_t *)0x400380A8))
#define ADC0_SSFSTAT3_R         (*((reg32_t *)0x400380AC))
#define ADC0_TMLB_R             (*((reg32_t *)0x40038100))
/*\}*/

/**
 * Comparator registers (COMP)
 */
/*\{*/
#define COMP_ACMIS_R            (*((reg32_t *)0x4003C000))
#define COMP_ACRIS_R            (*((reg32_t *)0x4003C004))
#define COMP_ACINTEN_R          (*((reg32_t *)0x4003C008))
#define COMP_ACREFCTL_R         (*((reg32_t *)0x4003C010))
#define COMP_ACSTAT0_R          (*((reg32_t *)0x4003C020))
#define COMP_ACCTL0_R           (*((reg32_t *)0x4003C024))
#define COMP_ACSTAT1_R          (*((reg32_t *)0x4003C040))
#define COMP_ACCTL1_R           (*((reg32_t *)0x4003C044))
#define COMP_ACSTAT2_R          (*((reg32_t *)0x4003C060))
#define COMP_ACCTL2_R           (*((reg32_t *)0x4003C064))
/*\}*/

/**
 * Hibernation module registers (HIB)
 */
/*\{*/
#define HIB_RTCC_R              (*((reg32_t *)0x400FC000))
#define HIB_RTCM0_R             (*((reg32_t *)0x400FC004))
#define HIB_RTCM1_R             (*((reg32_t *)0x400FC008))
#define HIB_RTCLD_R             (*((reg32_t *)0x400FC00C))
#define HIB_CTL_R               (*((reg32_t *)0x400FC010))
#define HIB_IM_R                (*((reg32_t *)0x400FC014))
#define HIB_RIS_R               (*((reg32_t *)0x400FC018))
#define HIB_MIS_R               (*((reg32_t *)0x400FC01C))
#define HIB_IC_R                (*((reg32_t *)0x400FC020))
#define HIB_RTCT_R              (*((reg32_t *)0x400FC024))
#define HIB_DATA_R              (*((reg32_t *)0x400FC030))
/*\}*/

/**
 * FLASH registers (FLASH CTRL)
 */
/*\{*/
#define FLASH_FMA_R             (*((reg32_t *)0x400FD000))
#define FLASH_FMD_R             (*((reg32_t *)0x400FD004))
#define FLASH_FMC_R             (*((reg32_t *)0x400FD008))
#define FLASH_FCRIS_R           (*((reg32_t *)0x400FD00C))
#define FLASH_FCIM_R            (*((reg32_t *)0x400FD010))
#define FLASH_FCMISC_R          (*((reg32_t *)0x400FD014))
#define FLASH_USECRL_R          (*((reg32_t *)0x400FE140))
#define FLASH_USERDBG_R         (*((reg32_t *)0x400FE1D0))
#define FLASH_USERREG0_R        (*((reg32_t *)0x400FE1E0))
#define FLASH_USERREG1_R        (*((reg32_t *)0x400FE1E4))
#define FLASH_FMPRE0_R          (*((reg32_t *)0x400FE200))
#define FLASH_FMPRE1_R          (*((reg32_t *)0x400FE204))
#define FLASH_FMPRE2_R          (*((reg32_t *)0x400FE208))
#define FLASH_FMPRE3_R          (*((reg32_t *)0x400FE20C))
#define FLASH_FMPPE0_R          (*((reg32_t *)0x400FE400))
#define FLASH_FMPPE1_R          (*((reg32_t *)0x400FE404))
#define FLASH_FMPPE2_R          (*((reg32_t *)0x400FE408))
#define FLASH_FMPPE3_R          (*((reg32_t *)0x400FE40C))
/*\}*/

/**
 * System Control registers (SYSCTL)
 */
/*\{*/
#define SYSCTL_DID0_R           (*((reg32_t *)0x400FE000))
#define SYSCTL_DID1_R           (*((reg32_t *)0x400FE004))
#define SYSCTL_DC0_R            (*((reg32_t *)0x400FE008))
#define SYSCTL_DC1_R            (*((reg32_t *)0x400FE010))
#define SYSCTL_DC2_R            (*((reg32_t *)0x400FE014))
#define SYSCTL_DC3_R            (*((reg32_t *)0x400FE018))
#define SYSCTL_DC4_R            (*((reg32_t *)0x400FE01C))
#define SYSCTL_PBORCTL_R        (*((reg32_t *)0x400FE030))
#define SYSCTL_LDOPCTL_R        (*((reg32_t *)0x400FE034))
#define SYSCTL_SRCR0_R          (*((reg32_t *)0x400FE040))
#define SYSCTL_SRCR1_R          (*((reg32_t *)0x400FE044))
#define SYSCTL_SRCR2_R          (*((reg32_t *)0x400FE048))
#define SYSCTL_RIS_R            (*((reg32_t *)0x400FE050))
#define SYSCTL_IMC_R            (*((reg32_t *)0x400FE054))
#define SYSCTL_MISC_R           (*((reg32_t *)0x400FE058))
#define SYSCTL_RESC_R           (*((reg32_t *)0x400FE05C))
#define SYSCTL_RCC_R            (*((reg32_t *)0x400FE060))
#define SYSCTL_PLLCFG_R         (*((reg32_t *)0x400FE064))
#define SYSCTL_RCC2_R           (*((reg32_t *)0x400FE070))
#define SYSCTL_RCGC0_R          (*((reg32_t *)0x400FE100))
#define SYSCTL_RCGC1_R          (*((reg32_t *)0x400FE104))
#define SYSCTL_RCGC2_R          (*((reg32_t *)0x400FE108))
#define SYSCTL_SCGC0_R          (*((reg32_t *)0x400FE110))
#define SYSCTL_SCGC1_R          (*((reg32_t *)0x400FE114))
#define SYSCTL_SCGC2_R          (*((reg32_t *)0x400FE118))
#define SYSCTL_DCGC0_R          (*((reg32_t *)0x400FE120))
#define SYSCTL_DCGC1_R          (*((reg32_t *)0x400FE124))
#define SYSCTL_DCGC2_R          (*((reg32_t *)0x400FE128))
#define SYSCTL_DSLPCLKCFG_R     (*((reg32_t *)0x400FE144))
/*\}*/

/**
 * NVIC registers (NVIC)
 */
/*\{*/
#define NVIC_INT_TYPE_R         (*((reg32_t *)0xE000E004))
#define NVIC_ST_CTRL_R          (*((reg32_t *)0xE000E010))
#define NVIC_ST_RELOAD_R        (*((reg32_t *)0xE000E014))
#define NVIC_ST_CURRENT_R       (*((reg32_t *)0xE000E018))
#define NVIC_ST_CAL_R           (*((reg32_t *)0xE000E01C))
#define NVIC_EN0_R              (*((reg32_t *)0xE000E100))
#define NVIC_EN1_R              (*((reg32_t *)0xE000E104))
#define NVIC_DIS0_R             (*((reg32_t *)0xE000E180))
#define NVIC_DIS1_R             (*((reg32_t *)0xE000E184))
#define NVIC_PEND0_R            (*((reg32_t *)0xE000E200))
#define NVIC_PEND1_R            (*((reg32_t *)0xE000E204))
#define NVIC_UNPEND0_R          (*((reg32_t *)0xE000E280))
#define NVIC_UNPEND1_R          (*((reg32_t *)0xE000E284))
#define NVIC_ACTIVE0_R          (*((reg32_t *)0xE000E300))
#define NVIC_ACTIVE1_R          (*((reg32_t *)0xE000E304))
#define NVIC_PRI0_R             (*((reg32_t *)0xE000E400))
#define NVIC_PRI1_R             (*((reg32_t *)0xE000E404))
#define NVIC_PRI2_R             (*((reg32_t *)0xE000E408))
#define NVIC_PRI3_R             (*((reg32_t *)0xE000E40C))
#define NVIC_PRI4_R             (*((reg32_t *)0xE000E410))
#define NVIC_PRI5_R             (*((reg32_t *)0xE000E414))
#define NVIC_PRI6_R             (*((reg32_t *)0xE000E418))
#define NVIC_PRI7_R             (*((reg32_t *)0xE000E41C))
#define NVIC_PRI8_R             (*((reg32_t *)0xE000E420))
#define NVIC_PRI9_R             (*((reg32_t *)0xE000E424))
#define NVIC_PRI10_R            (*((reg32_t *)0xE000E428))
#define NVIC_CPUID_R            (*((reg32_t *)0xE000ED00))
#define NVIC_INT_CTRL_R         (*((reg32_t *)0xE000ED04))
#define NVIC_VTABLE_R           (*((reg32_t *)0xE000ED08))
#define NVIC_APINT_R            (*((reg32_t *)0xE000ED0C))
#define NVIC_SYS_CTRL_R         (*((reg32_t *)0xE000ED10))
#define NVIC_CFG_CTRL_R         (*((reg32_t *)0xE000ED14))
#define NVIC_SYS_PRI1_R         (*((reg32_t *)0xE000ED18))
#define NVIC_SYS_PRI2_R         (*((reg32_t *)0xE000ED1C))
#define NVIC_SYS_PRI3_R         (*((reg32_t *)0xE000ED20))
#define NVIC_SYS_HND_CTRL_R     (*((reg32_t *)0xE000ED24))
#define NVIC_FAULT_STAT_R       (*((reg32_t *)0xE000ED28))
#define NVIC_HFAULT_STAT_R      (*((reg32_t *)0xE000ED2C))
#define NVIC_DEBUG_STAT_R       (*((reg32_t *)0xE000ED30))
#define NVIC_MM_ADDR_R          (*((reg32_t *)0xE000ED34))
#define NVIC_FAULT_ADDR_R       (*((reg32_t *)0xE000ED38))
#define NVIC_MPU_TYPE_R         (*((reg32_t *)0xE000ED90))
#define NVIC_MPU_CTRL_R         (*((reg32_t *)0xE000ED94))
#define NVIC_MPU_NUMBER_R       (*((reg32_t *)0xE000ED98))
#define NVIC_MPU_BASE_R         (*((reg32_t *)0xE000ED9C))
#define NVIC_MPU_ATTR_R         (*((reg32_t *)0xE000EDA0))
#define NVIC_DBG_CTRL_R         (*((reg32_t *)0xE000EDF0))
#define NVIC_DBG_XFER_R         (*((reg32_t *)0xE000EDF4))
#define NVIC_DBG_DATA_R         (*((reg32_t *)0xE000EDF8))
#define NVIC_DBG_INT_R          (*((reg32_t *)0xE000EDFC))
#define NVIC_SW_TRIG_R          (*((reg32_t *)0xE000EF00))
/*\}*/

/**
 * The following are defines for the bit fields in the WDT_O_LOAD register.
 */
/*\{*/
#define WDT_LOAD_M              0xFFFFFFFF  ///< Watchdog Load Value
#define WDT_LOAD_S              0
/*\}*/

/**
 * The following are defines for the bit fields in the WDT_O_VALUE register.
 */
/*\{*/
#define WDT_VALUE_M             0xFFFFFFFF  ///< Watchdog Value
#define WDT_VALUE_S             0
/*\}*/

/**
 * The following are defines for the bit fields in the WDT_O_CTL register.
 */
/*\{*/
#define WDT_CTL_RESEN           0x00000002  ///< Watchdog Reset Enable
#define WDT_CTL_INTEN           0x00000001  ///< Watchdog Interrupt Enable
/*\}*/

/**
 * The following are defines for the bit fields in the WDT_O_ICR register.
 */
/*\{*/
#define WDT_ICR_M               0xFFFFFFFF  ///< Watchdog Interrupt Clear
#define WDT_ICR_S               0
/*\}*/

/**
 * The following are defines for the bit fields in the WDT_O_RIS register.
 */
/*\{*/
#define WDT_RIS_WDTRIS          0x00000001  ///< Watchdog Raw Interrupt Status
/*\}*/

/**
 * The following are defines for the bit fields in the WDT_O_MIS register.
 */
/*\{*/
#define WDT_MIS_WDTMIS          0x00000001  ///< Watchdog Masked Interrupt Status
/*\}*/

/**
 * The following are defines for the bit fields in the WDT_O_TEST register.
 */
/*\{*/
#define WDT_TEST_STALL          0x00000100  ///< Watchdog Stall Enable
/*\}*/

/**
 * The following are defines for the bit fields in the WDT_O_LOCK register.
 */
/*\{*/
#define WDT_LOCK_M              0xFFFFFFFF  ///< Watchdog Lock
#define WDT_LOCK_UNLOCKED       0x00000000  ///< Unlocked
#define WDT_LOCK_LOCKED         0x00000001  ///< Locked
#define WDT_LOCK_UNLOCK         0x1ACCE551  ///< Unlocks the watchdog timer
/*\}*/

/**
 * The following are defines for the bit fields in the GPIO_O_LOCK register.
 */
/*\{*/
#define GPIO_LOCK_M             0xFFFFFFFF  ///< GPIO Lock
#define GPIO_LOCK_UNLOCKED      0x00000000  ///< The GPIOCR register is unlocked
                                            ///< and may be modified
#define GPIO_LOCK_LOCKED        0x00000001  ///< The GPIOCR register is locked
                                            ///< and may not be modified
#define GPIO_LOCK_KEY           0x1ACCE551  ///< Unlocks the GPIO_CR register
/*\}*/

/**
 * The following are defines for the bit fields in the SSI_O_CR0 register.
 */
/*\{*/
#define SSI_CR0_SCR_M           0x0000FF00  ///< SSI Serial Clock Rate
#define SSI_CR0_SPH             0x00000080  ///< SSI Serial Clock Phase
#define SSI_CR0_SPO             0x00000040  ///< SSI Serial Clock Polarity
#define SSI_CR0_FRF_M           0x00000030  ///< SSI Frame Format Select
#define SSI_CR0_FRF_MOTO        0x00000000  ///< Freescale SPI Frame Format
#define SSI_CR0_FRF_TI          0x00000010  ///< Texas Instruments Synchronous
                                            ///< Serial Frame Format
#define SSI_CR0_FRF_NMW         0x00000020  ///< MICROWIRE Frame Format
#define SSI_CR0_DSS_M           0x0000000F  ///< SSI Data Size Select
#define SSI_CR0_DSS_4           0x00000003  ///< 4-bit data
#define SSI_CR0_DSS_5           0x00000004  ///< 5-bit data
#define SSI_CR0_DSS_6           0x00000005  ///< 6-bit data
#define SSI_CR0_DSS_7           0x00000006  ///< 7-bit data
#define SSI_CR0_DSS_8           0x00000007  ///< 8-bit data
#define SSI_CR0_DSS_9           0x00000008  ///< 9-bit data
#define SSI_CR0_DSS_10          0x00000009  ///< 10-bit data
#define SSI_CR0_DSS_11          0x0000000A  ///< 11-bit data
#define SSI_CR0_DSS_12          0x0000000B  ///< 12-bit data
#define SSI_CR0_DSS_13          0x0000000C  ///< 13-bit data
#define SSI_CR0_DSS_14          0x0000000D  ///< 14-bit data
#define SSI_CR0_DSS_15          0x0000000E  ///< 15-bit data
#define SSI_CR0_DSS_16          0x0000000F  ///< 16-bit data
#define SSI_CR0_SCR_S           8
/*\}*/

/**
 * The following are defines for the bit fields in the SSI_O_CR1 register.
 */
/*\{*/
#define SSI_CR1_SOD             0x00000008  ///< SSI Slave Mode Output Disable
#define SSI_CR1_MS              0x00000004  ///< SSI Master/Slave Select
#define SSI_CR1_SSE             0x00000002  ///< SSI Synchronous Serial Port
                                            ///< Enable
#define SSI_CR1_LBM             0x00000001  ///< SSI Loopback Mode
/*\}*/

/**
 * The following are defines for the bit fields in the SSI_O_DR register.
 */
/*\{*/
#define SSI_DR_DATA_M           0x0000FFFF  ///< SSI Receive/Transmit Data
#define SSI_DR_DATA_S           0
/*\}*/

/**
 * The following are defines for the bit fields in the SSI_O_SR register.
 */
/*\{*/
#define SSI_SR_BSY              0x00000010  ///< SSI Busy Bit
#define SSI_SR_RFF              0x00000008  ///< SSI Receive FIFO Full
#define SSI_SR_RNE              0x00000004  ///< SSI Receive FIFO Not Empty
#define SSI_SR_TNF              0x00000002  ///< SSI Transmit FIFO Not Full
#define SSI_SR_TFE              0x00000001  ///< SSI Transmit FIFO Empty
/*\}*/

/**
 * The following are defines for the bit fields in the SSI_O_CPSR register.
 */
/*\{*/
#define SSI_CPSR_CPSDVSR_M      0x000000FF  ///< SSI Clock Prescale Divisor
#define SSI_CPSR_CPSDVSR_S      0
/*\}*/

/**
 * The following are defines for the bit fields in the SSI_O_IM register.
 */
/*\{*/
#define SSI_IM_TXIM             0x00000008  ///< SSI Transmit FIFO Interrupt Mask
#define SSI_IM_RXIM             0x00000004  ///< SSI Receive FIFO Interrupt Mask
#define SSI_IM_RTIM             0x00000002  ///< SSI Receive Time-Out Interrupt
                                            ///< Mask
#define SSI_IM_RORIM            0x00000001  ///< SSI Receive Overrun Interrupt
                                            ///< Mask
/*\}*/

/**
 * The following are defines for the bit fields in the SSI_O_RIS register.
 */
/*\{*/
#define SSI_RIS_TXRIS           0x00000008  ///< SSI Transmit FIFO Raw Interrupt
                                            ///< Status
#define SSI_RIS_RXRIS           0x00000004  ///< SSI Receive FIFO Raw Interrupt
                                            ///< Status
#define SSI_RIS_RTRIS           0x00000002  ///< SSI Receive Time-Out Raw
                                            ///< Interrupt Status
#define SSI_RIS_RORRIS          0x00000001  ///< SSI Receive Overrun Raw
                                            ///< Interrupt Status
/*\}*/

/**
 * The following are defines for the bit fields in the SSI_O_MIS register.
 */
/*\{*/
#define SSI_MIS_TXMIS           0x00000008  ///< SSI Transmit FIFO Masked
                                            ///< Interrupt Status
#define SSI_MIS_RXMIS           0x00000004  ///< SSI Receive FIFO Masked
                                            ///< Interrupt Status
#define SSI_MIS_RTMIS           0x00000002  ///< SSI Receive Time-Out Masked
                                            ///< Interrupt Status
#define SSI_MIS_RORMIS          0x00000001  ///< SSI Receive Overrun Masked
                                            ///< Interrupt Status
/*\}*/

/**
 * The following are defines for the bit fields in the SSI_O_ICR register.
 */
/*\{*/
#define SSI_ICR_RTIC            0x00000002  ///< SSI Receive Time-Out Interrupt
                                            ///< Clear
#define SSI_ICR_RORIC           0x00000001  ///< SSI Receive Overrun Interrupt
                                            ///< Clear
/*\}*/

/**
 * The following are defines for the bit fields in the UART_O_DR register.
 */
/*\{*/
#define UART_DR_OE              0x00000800  ///< UART Overrun Error
#define UART_DR_BE              0x00000400  ///< UART Break Error
#define UART_DR_PE              0x00000200  ///< UART Parity Error
#define UART_DR_FE              0x00000100  ///< UART Framing Error
#define UART_DR_DATA_M          0x000000FF  ///< Data Transmitted or Received
#define UART_DR_DATA_S          0
/*\}*/

/**
 * The following are defines for the bit fields in the UART_O_RSR register.
 */
/*\{*/
#define UART_RSR_OE             0x00000008  ///< UART Overrun Error
#define UART_RSR_BE             0x00000004  ///< UART Break Error
#define UART_RSR_PE             0x00000002  ///< UART Parity Error
#define UART_RSR_FE             0x00000001  ///< UART Framing Error
/*\}*/

/**
 * The following are defines for the bit fields in the UART_O_ECR register.
 */
/*\{*/
#define UART_ECR_DATA_M         0x000000FF  ///< Error Clear
#define UART_ECR_DATA_S         0
/*\}*/

/**
 * The following are defines for the bit fields in the UART_O_FR register.
 */
/*\{*/
#define UART_FR_TXFE            0x00000080  ///< UART Transmit FIFO Empty
#define UART_FR_RXFF            0x00000040  ///< UART Receive FIFO Full
#define UART_FR_TXFF            0x00000020  ///< UART Transmit FIFO Full
#define UART_FR_RXFE            0x00000010  ///< UART Receive FIFO Empty
#define UART_FR_BUSY            0x00000008  ///< UART Busy
/*\}*/

/**
 * The following are defines for the bit fields in the UART_O_ILPR register.
 */
/*\{*/
#define UART_ILPR_ILPDVSR_M     0x000000FF  ///< IrDA Low-Power Divisor
#define UART_ILPR_ILPDVSR_S     0
/*\}*/

/**
 * The following are defines for the bit fields in the UART_O_IBRD register.
 */
/*\{*/
#define UART_IBRD_DIVINT_M      0x0000FFFF  ///< Integer Baud-Rate Divisor
#define UART_IBRD_DIVINT_S      0
/*\}*/

/**
 * The following are defines for the bit fields in the UART_O_FBRD register.
 */
/*\{*/
#define UART_FBRD_DIVFRAC_M     0x0000003F  ///< Fractional Baud-Rate Divisor
#define UART_FBRD_DIVFRAC_S     0
/*\}*/

