markqvist/MicroAPRS/bertos/cpu/cortex-m3/io/lm3s_com.h
/**
 * The following are defines for the bit fields in the UART_O_LCRH register.
 */
/*\{*/
#define UART_LCRH_SPS           0x00000080  ///< UART Stick Parity Select
#define UART_LCRH_WLEN_M        0x00000060  ///< UART Word Length
#define UART_LCRH_WLEN_5        0x00000000  ///< 5 bits (default)
#define UART_LCRH_WLEN_6        0x00000020  ///< 6 bits
#define UART_LCRH_WLEN_7        0x00000040  ///< 7 bits
#define UART_LCRH_WLEN_8        0x00000060  ///< 8 bits
#define UART_LCRH_FEN           0x00000010  ///< UART Enable FIFOs
#define UART_LCRH_STP2          0x00000008  ///< UART Two Stop Bits Select
#define UART_LCRH_EPS           0x00000004  ///< UART Even Parity Select
#define UART_LCRH_PEN           0x00000002  ///< UART Parity Enable
#define UART_LCRH_BRK           0x00000001  ///< UART Send Break
/*\}*/

/**
 * The following are defines for the bit fields in the UART_O_CTL register.
 */
/*\{*/
#define UART_CTL_RXE            0x00000200  ///< UART Receive Enable
#define UART_CTL_TXE            0x00000100  ///< UART Transmit Enable
#define UART_CTL_LBE            0x00000080  ///< UART Loop Back Enable
#define UART_CTL_SIRLP          0x00000004  ///< UART SIR Low-Power Mode
#define UART_CTL_SIREN          0x00000002  ///< UART SIR Enable
#define UART_CTL_UARTEN         0x00000001  ///< UART Enable
/*\}*/

/**
 * The following are defines for the bit fields in the UART_O_IFLS register.
 */
/*\{*/
#define UART_IFLS_RX_M          0x00000038  ///< UART Receive Interrupt FIFO
                                            ///< Level Select
#define UART_IFLS_RX1_8         0x00000000  ///< RX FIFO >= 1/8 full
#define UART_IFLS_RX2_8         0x00000008  ///< RX FIFO >= 1/4 full
#define UART_IFLS_RX4_8         0x00000010  ///< RX FIFO >= 1/2 full (default)
#define UART_IFLS_RX6_8         0x00000018  ///< RX FIFO >= 3/4 full
#define UART_IFLS_RX7_8         0x00000020  ///< RX FIFO >= 7/8 full
#define UART_IFLS_TX_M          0x00000007  ///< UART Transmit Interrupt FIFO
                                            ///< Level Select
#define UART_IFLS_TX1_8         0x00000000  ///< TX FIFO <= 1/8 full
#define UART_IFLS_TX2_8         0x00000001  ///< TX FIFO <= 1/4 full
#define UART_IFLS_TX4_8         0x00000002  ///< TX FIFO <= 1/2 full (default)
#define UART_IFLS_TX6_8         0x00000003  ///< TX FIFO <= 3/4 full
#define UART_IFLS_TX7_8         0x00000004  ///< TX FIFO <= 7/8 full
/*\}*/

/**
 * The following are defines for the bit fields in the UART_O_IM register.
 */
/*\{*/
#define UART_IM_OEIM            0x00000400  ///< UART Overrun Error Interrupt
                                            ///< Mask
#define UART_IM_BEIM            0x00000200  ///< UART Break Error Interrupt Mask
#define UART_IM_PEIM            0x00000100  ///< UART Parity Error Interrupt Mask
#define UART_IM_FEIM            0x00000080  ///< UART Framing Error Interrupt
                                            ///< Mask
#define UART_IM_RTIM            0x00000040  ///< UART Receive Time-Out Interrupt
                                            ///< Mask
#define UART_IM_TXIM            0x00000020  ///< UART Transmit Interrupt Mask
#define UART_IM_RXIM            0x00000010  ///< UART Receive Interrupt Mask
/*\}*/

/**
 * The following are defines for the bit fields in the UART_O_RIS register.
 */
/*\{*/
#define UART_RIS_OERIS          0x00000400  ///< UART Overrun Error Raw Interrupt
                                            ///< Status
#define UART_RIS_BERIS          0x00000200  ///< UART Break Error Raw Interrupt
                                            ///< Status
#define UART_RIS_PERIS          0x00000100  ///< UART Parity Error Raw Interrupt
                                            ///< Status
#define UART_RIS_FERIS          0x00000080  ///< UART Framing Error Raw Interrupt
                                            ///< Status
#define UART_RIS_RTRIS          0x00000040  ///< UART Receive Time-Out Raw
                                            ///< Interrupt Status
#define UART_RIS_TXRIS          0x00000020  ///< UART Transmit Raw Interrupt
                                            ///< Status
#define UART_RIS_RXRIS          0x00000010  ///< UART Receive Raw Interrupt
                                            ///< Status
/*\}*/

/**
 * The following are defines for the bit fields in the UART_O_MIS register.
 */
/*\{*/
#define UART_MIS_OEMIS          0x00000400  ///< UART Overrun Error Masked
                                            ///< Interrupt Status
#define UART_MIS_BEMIS          0x00000200  ///< UART Break Error Masked
                                            ///< Interrupt Status
#define UART_MIS_PEMIS          0x00000100  ///< UART Parity Error Masked
                                            ///< Interrupt Status
#define UART_MIS_FEMIS          0x00000080  ///< UART Framing Error Masked
                                            ///< Interrupt Status
#define UART_MIS_RTMIS          0x00000040  ///< UART Receive Time-Out Masked
                                            ///< Interrupt Status
#define UART_MIS_TXMIS          0x00000020  ///< UART Transmit Masked Interrupt
                                            ///< Status
#define UART_MIS_RXMIS          0x00000010  ///< UART Receive Masked Interrupt
                                            ///< Status
/*\}*/

/**
 * The following are defines for the bit fields in the UART_O_ICR register.
 */
/*\{*/
#define UART_ICR_OEIC           0x00000400  ///< Overrun Error Interrupt Clear
#define UART_ICR_BEIC           0x00000200  ///< Break Error Interrupt Clear
#define UART_ICR_PEIC           0x00000100  ///< Parity Error Interrupt Clear
#define UART_ICR_FEIC           0x00000080  ///< Framing Error Interrupt Clear
#define UART_ICR_RTIC           0x00000040  ///< Receive Time-Out Interrupt Clear
#define UART_ICR_TXIC           0x00000020  ///< Transmit Interrupt Clear
#define UART_ICR_RXIC           0x00000010  ///< Receive Interrupt Clear
/*\}*/

/**
 * The following are defines for the bit fields in the I2C_O_MSA register.
 */
/*\{*/
#define I2C_MSA_SA_M            0x000000FE  ///< I2C Slave Address
#define I2C_MSA_RS              0x00000001  ///< Receive not send
#define I2C_MSA_SA_S            1
/*\}*/

/**
 * The following are defines for the bit fields in the I2C_O_SOAR register.
 */
/*\{*/
#define I2C_SOAR_OAR_M          0x0000007F  ///< I2C Slave Own Address
#define I2C_SOAR_OAR_S          0
/*\}*/

/**
 * The following are defines for the bit fields in the I2C_O_SCSR register.
 */
/*\{*/
#define I2C_SCSR_FBR            0x00000004  ///< First Byte Received
#define I2C_SCSR_TREQ           0x00000002  ///< Transmit Request
#define I2C_SCSR_DA             0x00000001  ///< Device Active
#define I2C_SCSR_RREQ           0x00000001  ///< Receive Request
/*\}*/

/**
 * The following are defines for the bit fields in the I2C_O_MCS register.
 */
/*\{*/
#define I2C_MCS_BUSBSY          0x00000040  ///< Bus Busy
#define I2C_MCS_IDLE            0x00000020  ///< I2C Idle
#define I2C_MCS_ARBLST          0x00000010  ///< Arbitration Lost
#define I2C_MCS_ACK             0x00000008  ///< Data Acknowledge Enable
#define I2C_MCS_DATACK          0x00000008  ///< Acknowledge Data
#define I2C_MCS_ADRACK          0x00000004  ///< Acknowledge Address
#define I2C_MCS_STOP            0x00000004  ///< Generate STOP
#define I2C_MCS_START           0x00000002  ///< Generate START
#define I2C_MCS_ERROR           0x00000002  ///< Error
#define I2C_MCS_RUN             0x00000001  ///< I2C Master Enable
#define I2C_MCS_BUSY            0x00000001  ///< I2C Busy
/*\}*/

/**
 * The following are defines for the bit fields in the I2C_O_SDR register.
 */
/*\{*/
#define I2C_SDR_DATA_M          0x000000FF  ///< Data for Transfer
#define I2C_SDR_DATA_S          0
/*\}*/

/**
 * The following are defines for the bit fields in the I2C_O_MDR register.
 */
/*\{*/
#define I2C_MDR_DATA_M          0x000000FF  ///< Data Transferred
#define I2C_MDR_DATA_S          0
/*\}*/

/**
 * The following are defines for the bit fields in the I2C_O_MTPR register.
 */
/*\{*/
#define I2C_MTPR_TPR_M          0x000000FF  ///< SCL Clock Period
#define I2C_MTPR_TPR_S          0
/*\}*/

/**
 * The following are defines for the bit fields in the I2C_O_SIMR register.
 */
/*\{*/
#define I2C_SIMR_DATAIM         0x00000001  ///< Data Interrupt Mask
/*\}*/

/**
 * The following are defines for the bit fields in the I2C_O_SRIS register.
 */
/*\{*/
#define I2C_SRIS_DATARIS        0x00000001  ///< Data Raw Interrupt Status
/*\}*/

/**
 * The following are defines for the bit fields in the I2C_O_MIMR register.
 */
/*\{*/
#define I2C_MIMR_IM             0x00000001  ///< Interrupt Mask
/*\}*/

/**
 * The following are defines for the bit fields in the I2C_O_MRIS register.
 */
/*\{*/
#define I2C_MRIS_RIS            0x00000001  ///< Raw Interrupt Status
/*\}*/

/**
 * The following are defines for the bit fields in the I2C_O_SMIS register.
 */
/*\{*/
#define I2C_SMIS_DATAMIS        0x00000001  ///< Data Masked Interrupt Status
/*\}*/

/**
 * The following are defines for the bit fields in the I2C_O_SICR register.
 */
/*\{*/
#define I2C_SICR_DATAIC         0x00000001  ///< Data Interrupt Clear
/*\}*/

/**
 * The following are defines for the bit fields in the I2C_O_MMIS register.
 */
/*\{*/
#define I2C_MMIS_MIS            0x00000001  ///< Masked Interrupt Status
/*\}*/

/**
 * The following are defines for the bit fields in the I2C_O_MICR register.
 */
/*\{*/
#define I2C_MICR_IC             0x00000001  ///< Interrupt Clear
/*\}*/

/**
 * The following are defines for the bit fields in the I2C_O_MCR register.
 */
/*\{*/
#define I2C_MCR_SFE             0x00000020  ///< I2C Slave Function Enable
#define I2C_MCR_MFE             0x00000010  ///< I2C Master Function Enable
#define I2C_MCR_LPBK            0x00000001  ///< I2C Loopback
/*\}*/

/**
 * The following are defines for the bit fields in the PWM_O_CTL register.
 */
/*\{*/
#define PWM_CTL_GLOBALSYNC2     0x00000004  ///< Update PWM Generator 2
#define PWM_CTL_GLOBALSYNC1     0x00000002  ///< Update PWM Generator 1
#define PWM_CTL_GLOBALSYNC0     0x00000001  ///< Update PWM Generator 0
/*\}*/

/**
 * The following are defines for the bit fields in the PWM_O_SYNC register.
 */
/*\{*/
#define PWM_SYNC_SYNC2          0x00000004  ///< Reset Generator 2 Counter
#define PWM_SYNC_SYNC1          0x00000002  ///< Reset Generator 1 Counter
#define PWM_SYNC_SYNC0          0x00000001  ///< Reset Generator 0 Counter
/*\}*/

/**
 * The following are defines for the bit fields in the PWM_O_ENABLE register.
 */
/*\{*/
#define PWM_ENABLE_PWM5EN       0x00000020  ///< PWM5 Output Enable
#define PWM_ENABLE_PWM4EN       0x00000010  ///< PWM4 Output Enable
#define PWM_ENABLE_PWM3EN       0x00000008  ///< PWM3 Output Enable
#define PWM_ENABLE_PWM2EN       0x00000004  ///< PWM2 Output Enable
#define PWM_ENABLE_PWM1EN       0x00000002  ///< PWM1 Output Enable
#define PWM_ENABLE_PWM0EN       0x00000001  ///< PWM0 Output Enable
/*\}*/

/**
 * The following are defines for the bit fields in the PWM_O_INVERT register.
 */
/*\{*/
#define PWM_INVERT_PWM5INV      0x00000020  ///< Invert PWM5 Signal
#define PWM_INVERT_PWM4INV      0x00000010  ///< Invert PWM4 Signal
#define PWM_INVERT_PWM3INV      0x00000008  ///< Invert PWM3 Signal
#define PWM_INVERT_PWM2INV      0x00000004  ///< Invert PWM2 Signal
#define PWM_INVERT_PWM1INV      0x00000002  ///< Invert PWM1 Signal
#define PWM_INVERT_PWM0INV      0x00000001  ///< Invert PWM0 Signal
/*\}*/

/**
 * The following are defines for the bit fields in the PWM_O_FAULT register.
 */
/*\{*/
#define PWM_FAULT_FAULT5        0x00000020  ///< PWM5 Fault
#define PWM_FAULT_FAULT4        0x00000010  ///< PWM4 Fault
#define PWM_FAULT_FAULT3        0x00000008  ///< PWM3 Fault
#define PWM_FAULT_FAULT2        0x00000004  ///< PWM2 Fault
#define PWM_FAULT_FAULT1        0x00000002  ///< PWM1 Fault
#define PWM_FAULT_FAULT0        0x00000001  ///< PWM0 Fault
/*\}*/

/**
 * The following are defines for the bit fields in the PWM_O_INTEN register.
 */
/*\{*/
#define PWM_INTEN_INTFAULT      0x00010000  ///< Fault Interrupt Enable
#define PWM_INTEN_INTPWM2       0x00000004  ///< PWM2 Interrupt Enable
#define PWM_INTEN_INTPWM1       0x00000002  ///< PWM1 Interrupt Enable
#define PWM_INTEN_INTPWM0       0x00000001  ///< PWM0 Interrupt Enable
/*\}*/

/**
 * The following are defines for the bit fields in the PWM_O_RIS register.
 */
/*\{*/
#define PWM_RIS_INTFAULT        0x00010000  ///< Fault Interrupt Asserted
#define PWM_RIS_INTPWM2         0x00000004  ///< PWM2 Interrupt Asserted
#define PWM_RIS_INTPWM1         0x00000002  ///< PWM1 Interrupt Asserted
#define PWM_RIS_INTPWM0         0x00000001  ///< PWM0 Interrupt Asserted
/*\}*/

/**
 * The following are defines for the bit fields in the PWM_O_ISC register.
 */
/*\{*/
#define PWM_ISC_INTFAULT        0x00010000  ///< Fault Interrupt Asserted
#define PWM_ISC_INTPWM2         0x00000004  ///< PWM2 Interrupt Status
#define PWM_ISC_INTPWM1         0x00000002  ///< PWM1 Interrupt Status
#define PWM_ISC_INTPWM0         0x00000001  ///< PWM0 Interrupt Status
/*\}*/

/**
 * The following are defines for the bit fields in the PWM_O_STATUS register.
 */
/*\{*/
#define PWM_STATUS_FAULT        0x00000001  ///< Fault Interrupt Status
/*\}*/

/**
 * The following are defines for the bit fields in the PWM_O_X_CTL register.
 */
/*\{*/
#define PWM_X_CTL_CMPBUPD       0x00000020  ///< Comparator B Update Mode
#define PWM_X_CTL_CMPAUPD       0x00000010  ///< Comparator A Update Mode
#define PWM_X_CTL_LOADUPD       0x00000008  ///< Load Register Update Mode
#define PWM_X_CTL_DEBUG         0x00000004  ///< Debug Mode
#define PWM_X_CTL_MODE          0x00000002  ///< Counter Mode
#define PWM_X_CTL_ENABLE        0x00000001  ///< PWM Block Enable
/*\}*/

/**
 * The following are defines for the bit fields in the PWM_O_X_INTEN register.
 */
/*\{*/
#define PWM_X_INTEN_TRCMPBD     0x00002000  ///< Trigger for Counter=PWMnCMPB
                                            ///< Down
#define PWM_X_INTEN_TRCMPBU     0x00001000  ///< Trigger for Counter=PWMnCMPB Up
#define PWM_X_INTEN_TRCMPAD     0x00000800  ///< Trigger for Counter=PWMnCMPA
                                            ///< Down
#define PWM_X_INTEN_TRCMPAU     0x00000400  ///< Trigger for Counter=PWMnCMPA Up
#define PWM_X_INTEN_TRCNTLOAD   0x00000200  ///< Trigger for Counter=PWMnLOAD
#define PWM_X_INTEN_TRCNTZERO   0x00000100  ///< Trigger for Counter=0
#define PWM_X_INTEN_INTCMPBD    0x00000020  ///< Interrupt for Counter=PWMnCMPB
                                            ///< Down
#define PWM_X_INTEN_INTCMPBU    0x00000010  ///< Interrupt for Counter=PWMnCMPB
                                            ///< Up
#define PWM_X_INTEN_INTCMPAD    0x00000008  ///< Interrupt for Counter=PWMnCMPA
                                            ///< Down
#define PWM_X_INTEN_INTCMPAU    0x00000004  ///< Interrupt for Counter=PWMnCMPA
                                            ///< Up
#define PWM_X_INTEN_INTCNTLOAD  0x00000002  ///< Interrupt for Counter=PWMnLOAD
#define PWM_X_INTEN_INTCNTZERO  0x00000001  ///< Interrupt for Counter=0
/*\}*/

/**
 * The following are defines for the bit fields in the PWM_O_X_RIS register.
 */
/*\{*/
#define PWM_X_RIS_INTCMPBD      0x00000020  ///< Comparator B Down Interrupt
                                            ///< Status
#define PWM_X_RIS_INTCMPBU      0x00000010  ///< Comparator B Up Interrupt Status
#define PWM_X_RIS_INTCMPAD      0x00000008  ///< Comparator A Down Interrupt
                                            ///< Status
#define PWM_X_RIS_INTCMPAU      0x00000004  ///< Comparator A Up Interrupt Status
#define PWM_X_RIS_INTCNTLOAD    0x00000002  ///< Counter=Load Interrupt Status
#define PWM_X_RIS_INTCNTZERO    0x00000001  ///< Counter=0 Interrupt Status
/*\}*/

/**
 * The following are defines for the bit fields in the PWM_O_X_ISC register.
 */
/*\{*/
#define PWM_X_ISC_INTCMPBD      0x00000020  ///< Comparator B Down Interrupt
#define PWM_X_ISC_INTCMPBU      0x00000010  ///< Comparator B Up Interrupt
#define PWM_X_ISC_INTCMPAD      0x00000008  ///< Comparator A Down Interrupt
#define PWM_X_ISC_INTCMPAU      0x00000004  ///< Comparator A Up Interrupt
#define PWM_X_ISC_INTCNTLOAD    0x00000002  ///< Counter=Load Interrupt
#define PWM_X_ISC_INTCNTZERO    0x00000001  ///< Counter=0 Interrupt
/*\}*/

/**
 * The following are defines for the bit fields in the PWM_O_X_LOAD register.
 */
/*\{*/
#define PWM_X_LOAD_M            0x0000FFFF  ///< Counter Load Value
#define PWM_X_LOAD_S            0
/*\}*/

/**
 * The following are defines for the bit fields in the PWM_O_X_COUNT register.
 */
/*\{*/
#define PWM_X_COUNT_M           0x0000FFFF  ///< Counter Value
#define PWM_X_COUNT_S           0
/*\}*/

/**
 * The following are defines for the bit fields in the PWM_O_X_CMPA register.
 */
/*\{*/
#define PWM_X_CMPA_M            0x0000FFFF  ///< Comparator A Value
#define PWM_X_CMPA_S            0
/*\}*/

/**
 * The following are defines for the bit fields in the PWM_O_X_CMPB register.
 */
/*\{*/
#define PWM_X_CMPB_M            0x0000FFFF  ///< Comparator B Value
#define PWM_X_CMPB_S            0
/*\}*/

/**
 * The following are defines for the bit fields in the PWM_O_X_GENA register.
 */
/*\{*/
#define PWM_X_GENA_ACTCMPBD_M   0x00000C00  ///< Action for Comparator B Down
#define PWM_X_GENA_ACTCMPBD_NONE 0x00000000  ///< Do nothing
#define PWM_X_GENA_ACTCMPBD_INV 0x00000400  ///< Invert pwmA
#define PWM_X_GENA_ACTCMPBD_ZERO 0x00000800  ///< Drive pwmA Low
#define PWM_X_GENA_ACTCMPBD_ONE 0x00000C00  ///< Drive pwmA High
#define PWM_X_GENA_ACTCMPBU_M   0x00000300  ///< Action for Comparator B Up
#define PWM_X_GENA_ACTCMPBU_NONE 0x00000000  ///< Do nothing
#define PWM_X_GENA_ACTCMPBU_INV 0x00000100  ///< Invert pwmA
#define PWM_X_GENA_ACTCMPBU_ZERO 0x00000200  ///< Drive pwmA Low
#define PWM_X_GENA_ACTCMPBU_ONE 0x00000300  ///< Drive pwmA High
#define PWM_X_GENA_ACTCMPAD_M   0x000000C0  ///< Action for Comparator A Down
#define PWM_X_GENA_ACTCMPAD_NONE 0x00000000  ///< Do nothing
#define PWM_X_GENA_ACTCMPAD_INV 0x00000040  ///< Invert pwmA
#define PWM_X_GENA_ACTCMPAD_ZERO 0x00000080  ///< Drive pwmA Low
#define PWM_X_GENA_ACTCMPAD_ONE 0x000000C0  ///< Drive pwmA High
#define PWM_X_GENA_ACTCMPAU_M   0x00000030  ///< Action for Comparator A Up
#define PWM_X_GENA_ACTCMPAU_NONE 0x00000000  ///< Do nothing
#define PWM_X_GENA_ACTCMPAU_INV 0x00000010  ///< Invert pwmA
#define PWM_X_GENA_ACTCMPAU_ZERO 0x00000020  ///< Drive pwmA Low
#define PWM_X_GENA_ACTCMPAU_ONE 0x00000030  ///< Drive pwmA High
#define PWM_X_GENA_ACTLOAD_M    0x0000000C  ///< Action for Counter=LOAD
#define PWM_X_GENA_ACTLOAD_NONE 0x00000000  ///< Do nothing
#define PWM_X_GENA_ACTLOAD_INV  0x00000004  ///< Invert pwmA
#define PWM_X_GENA_ACTLOAD_ZERO 0x00000008  ///< Drive pwmA Low
#define PWM_X_GENA_ACTLOAD_ONE  0x0000000C  ///< Drive pwmA High
#define PWM_X_GENA_ACTZERO_M    0x00000003  ///< Action for Counter=0
#define PWM_X_GENA_ACTZERO_NONE 0x00000000  ///< Do nothing
#define PWM_X_GENA_ACTZERO_INV  0x00000001  ///< Invert pwmA
#define PWM_X_GENA_ACTZERO_ZERO 0x00000002  ///< Drive pwmA Low
#define PWM_X_GENA_ACTZERO_ONE  0x00000003  ///< Drive pwmA High
/*\}*/

/**
 * The following are defines for the bit fields in the PWM_O_X_GENB register.
 */
/*\{*/
#define PWM_X_GENB_ACTCMPBD_M   0x00000C00  ///< Action for Comparator B Down
#define PWM_X_GENB_ACTCMPBD_NONE 0x00000000  ///< Do nothing
#define PWM_X_GENB_ACTCMPBD_INV 0x00000400  ///< Invert pwmB
#define PWM_X_GENB_ACTCMPBD_ZERO 0x00000800  ///< Drive pwmB Low
#define PWM_X_GENB_ACTCMPBD_ONE 0x00000C00  ///< Drive pwmB High
#define PWM_X_GENB_ACTCMPBU_M   0x00000300  ///< Action for Comparator B Up
#define PWM_X_GENB_ACTCMPBU_NONE 0x00000000  ///< Do nothing
#define PWM_X_GENB_ACTCMPBU_INV 0x00000100  ///< Invert pwmB
#define PWM_X_GENB_ACTCMPBU_ZERO 0x00000200  ///< Drive pwmB Low
#define PWM_X_GENB_ACTCMPBU_ONE 0x00000300  ///< Drive pwmB High
#define PWM_X_GENB_ACTCMPAD_M   0x000000C0  ///< Action for Comparator A Down
#define PWM_X_GENB_ACTCMPAD_NONE 0x00000000  ///< Do nothing
#define PWM_X_GENB_ACTCMPAD_INV 0x00000040  ///< Invert pwmB
#define PWM_X_GENB_ACTCMPAD_ZERO 0x00000080  ///< Drive pwmB Low
#define PWM_X_GENB_ACTCMPAD_ONE 0x000000C0  ///< Drive pwmB High
#define PWM_X_GENB_ACTCMPAU_M   0x00000030  ///< Action for Comparator A Up
#define PWM_X_GENB_ACTCMPAU_NONE 0x00000000  ///< Do nothing
#define PWM_X_GENB_ACTCMPAU_INV 0x00000010  ///< Invert pwmB
#define PWM_X_GENB_ACTCMPAU_ZERO 0x00000020  ///< Drive pwmB Low
#define PWM_X_GENB_ACTCMPAU_ONE 0x00000030  ///< Drive pwmB High
#define PWM_X_GENB_ACTLOAD_M    0x0000000C  ///< Action for Counter=LOAD
#define PWM_X_GENB_ACTLOAD_NONE 0x00000000  ///< Do nothing
#define PWM_X_GENB_ACTLOAD_INV  0x00000004  ///< Invert pwmB
#define PWM_X_GENB_ACTLOAD_ZERO 0x00000008  ///< Drive pwmB Low
#define PWM_X_GENB_ACTLOAD_ONE  0x0000000C  ///< Drive pwmB High
#define PWM_X_GENB_ACTZERO_M    0x00000003  ///< Action for Counter=0
#define PWM_X_GENB_ACTZERO_NONE 0x00000000  ///< Do nothing
#define PWM_X_GENB_ACTZERO_INV  0x00000001  ///< Invert pwmB
#define PWM_X_GENB_ACTZERO_ZERO 0x00000002  ///< Drive pwmB Low
#define PWM_X_GENB_ACTZERO_ONE  0x00000003  ///< Drive pwmB High
/*\}*/

/**
 * The following are defines for the bit fields in the PWM_O_X_DBCTL register.
 */
/*\{*/
#define PWM_X_DBCTL_ENABLE      0x00000001  ///< Dead-Band Generator Enable
/*\}*/

/**
 * The following are defines for the bit fields in the PWM_O_X_DBRISE register.
 */
/*\{*/
#define PWM_X_DBRISE_DELAY_M    0x00000FFF  ///< Dead-Band Rise Delay
#define PWM_X_DBRISE_DELAY_S    0
/*\}*/

/**
 * The following are defines for the bit fields in the PWM_O_X_DBFALL register.
 */
/*\{*/
#define PWM_X_DBFALL_DELAY_M    0x00000FFF  ///< Dead-Band Fall Delay
#define PWM_X_DBFALL_DELAY_S    0
/*\}*/

/**
 * The following are defines for the bit fields in the QEI_O_CTL register.
 */
/*\{*/
#define QEI_CTL_STALLEN         0x00001000  ///< Stall QEI
#define QEI_CTL_INVI            0x00000800  ///< Invert Index Pulse
#define QEI_CTL_INVB            0x00000400  ///< Invert PhB
#define QEI_CTL_INVA            0x00000200  ///< Invert PhA
#define QEI_CTL_VELDIV_M        0x000001C0  ///< Predivide Velocity
#define QEI_CTL_VELDIV_1        0x00000000  ///< QEI clock /1
#define QEI_CTL_VELDIV_2        0x00000040  ///< QEI clock /2
#define QEI_CTL_VELDIV_4        0x00000080  ///< QEI clock /4
#define QEI_CTL_VELDIV_8        0x000000C0  ///< QEI clock /8
#define QEI_CTL_VELDIV_16       0x00000100  ///< QEI clock /16
#define QEI_CTL_VELDIV_32       0x00000140  ///< QEI clock /32
#define QEI_CTL_VELDIV_64       0x00000180  ///< QEI clock /64
#define QEI_CTL_VELDIV_128      0x000001C0  ///< QEI clock /128
#define QEI_CTL_VELEN           0x00000020  ///< Capture Velocity
#define QEI_CTL_RESMODE         0x00000010  ///< Reset Mode
#define QEI_CTL_CAPMODE         0x00000008  ///< Capture Mode
#define QEI_CTL_SIGMODE         0x00000004  ///< Signal Mode
#define QEI_CTL_SWAP            0x00000002  ///< Swap Signals
#define QEI_CTL_ENABLE          0x00000001  ///< Enable QEI
/*\}*/

/**
 * The following are defines for the bit fields in the QEI_O_STAT register.
 */
/*\{*/
#define QEI_STAT_DIRECTION      0x00000002  ///< Direction of Rotation
#define QEI_STAT_ERROR          0x00000001  ///< Error Detected
/*\}*/

/**
 * The following are defines for the bit fields in the QEI_O_POS register.
 */
/*\{*/
#define QEI_POS_M               0xFFFFFFFF  ///< Current Position Integrator Value
#define QEI_POS_S               0
/*\}*/

/**
 * The following are defines for the bit fields in the QEI_O_MAXPOS register.
 */
/*\{*/
#define QEI_MAXPOS_M            0xFFFFFFFF  ///< Maximum Position Integrator Value
#define QEI_MAXPOS_S            0
/*\}*/

