markqvist/MicroAPRS/bertos/cpu/cortex-m3/io/lm3s_com.h
/**
 * The following are defines for the bit fields in the QEI_O_LOAD register.
 */
/*\{*/
#define QEI_LOAD_M              0xFFFFFFFF  ///< Velocity Timer Load Value
#define QEI_LOAD_S              0
/*\}*/

/**
 * The following are defines for the bit fields in the QEI_O_TIME register.
 */
/*\{*/
#define QEI_TIME_M              0xFFFFFFFF  ///< Velocity Timer Current Value
#define QEI_TIME_S              0
/*\}*/

/**
 * The following are defines for the bit fields in the QEI_O_COUNT register.
 */
/*\{*/
#define QEI_COUNT_M             0xFFFFFFFF  ///< Velocity Pulse Count
#define QEI_COUNT_S             0
/*\}*/

/**
 * The following are defines for the bit fields in the QEI_O_SPEED register.
 */
/*\{*/
#define QEI_SPEED_M             0xFFFFFFFF  ///< Velocity
#define QEI_SPEED_S             0
/*\}*/

/**
 * The following are defines for the bit fields in the QEI_O_INTEN register.
 */
/*\{*/
#define QEI_INTEN_ERROR         0x00000008  ///< Phase Error Interrupt Enable
#define QEI_INTEN_DIR           0x00000004  ///< Direction Change Interrupt
                                            ///< Enable
#define QEI_INTEN_TIMER         0x00000002  ///< Timer Expires Interrupt Enable
#define QEI_INTEN_INDEX         0x00000001  ///< Index Pulse Detected Interrupt
                                            ///< Enable
/*\}*/

/**
 * The following are defines for the bit fields in the QEI_O_RIS register.
 */
/*\{*/
#define QEI_RIS_ERROR           0x00000008  ///< Phase Error Detected
#define QEI_RIS_DIR             0x00000004  ///< Direction Change Detected
#define QEI_RIS_TIMER           0x00000002  ///< Velocity Timer Expired
#define QEI_RIS_INDEX           0x00000001  ///< Index Pulse Asserted
/*\}*/

/**
 * The following are defines for the bit fields in the QEI_O_ISC register.
 */
/*\{*/
#define QEI_ISC_ERROR           0x00000008  ///< Phase Error Interrupt
#define QEI_ISC_DIR             0x00000004  ///< Direction Change Interrupt
#define QEI_ISC_TIMER           0x00000002  ///< Velocity Timer Expired Interrupt
#define QEI_ISC_INDEX           0x00000001  ///< Index Pulse Interrupt
/*\}*/

/**
 * The following are defines for the bit fields in the TIMER_O_CFG register.
 */
/*\{*/
#define TIMER_CFG_M             0x00000007  ///< GPTM Configuration
#define TIMER_CFG_32_BIT_TIMER  0x00000000  ///< 32-bit timer configuration
#define TIMER_CFG_32_BIT_RTC    0x00000001  ///< 32-bit real-time clock (RTC)
                                            ///< counter configuration
#define TIMER_CFG_16_BIT        0x00000004  ///< 16-bit timer configuration. The
                                            ///< function is controlled by bits
                                            ///< 1:0 of GPTMTAMR and GPTMTBMR
/*\}*/

/**
 * The following are defines for the bit fields in the TIMER_O_TAMR register.
 */
/*\{*/
#define TIMER_TAMR_TAAMS        0x00000008  ///< GPTM Timer A Alternate Mode
                                            ///< Select
#define TIMER_TAMR_TACMR        0x00000004  ///< GPTM Timer A Capture Mode
#define TIMER_TAMR_TAMR_M       0x00000003  ///< GPTM Timer A Mode
#define TIMER_TAMR_TAMR_1_SHOT  0x00000001  ///< One-Shot Timer mode
#define TIMER_TAMR_TAMR_PERIOD  0x00000002  ///< Periodic Timer mode
#define TIMER_TAMR_TAMR_CAP     0x00000003  ///< Capture mode
/*\}*/

/**
 * The following are defines for the bit fields in the TIMER_O_TBMR register.
 */
/*\{*/
#define TIMER_TBMR_TBAMS        0x00000008  ///< GPTM Timer B Alternate Mode
                                            ///< Select
#define TIMER_TBMR_TBCMR        0x00000004  ///< GPTM Timer B Capture Mode
#define TIMER_TBMR_TBMR_M       0x00000003  ///< GPTM Timer B Mode
#define TIMER_TBMR_TBMR_1_SHOT  0x00000001  ///< One-Shot Timer mode
#define TIMER_TBMR_TBMR_PERIOD  0x00000002  ///< Periodic Timer mode
#define TIMER_TBMR_TBMR_CAP     0x00000003  ///< Capture mode
/*\}*/

/**
 * The following are defines for the bit fields in the TIMER_O_CTL register.
 */
/*\{*/
#define TIMER_CTL_TBPWML        0x00004000  ///< GPTM Timer B PWM Output Level
#define TIMER_CTL_TBOTE         0x00002000  ///< GPTM Timer B Output Trigger
                                            ///< Enable
#define TIMER_CTL_TBEVENT_M     0x00000C00  ///< GPTM Timer B Event Mode
#define TIMER_CTL_TBEVENT_POS   0x00000000  ///< Positive edge
#define TIMER_CTL_TBEVENT_NEG   0x00000400  ///< Negative edge
#define TIMER_CTL_TBEVENT_BOTH  0x00000C00  ///< Both edges
#define TIMER_CTL_TBSTALL       0x00000200  ///< GPTM Timer B Stall Enable
#define TIMER_CTL_TBEN          0x00000100  ///< GPTM Timer B Enable
#define TIMER_CTL_TAPWML        0x00000040  ///< GPTM Timer A PWM Output Level
#define TIMER_CTL_TAOTE         0x00000020  ///< GPTM Timer A Output Trigger
                                            ///< Enable
#define TIMER_CTL_RTCEN         0x00000010  ///< GPTM RTC Enable
#define TIMER_CTL_TAEVENT_M     0x0000000C  ///< GPTM Timer A Event Mode
#define TIMER_CTL_TAEVENT_POS   0x00000000  ///< Positive edge
#define TIMER_CTL_TAEVENT_NEG   0x00000004  ///< Negative edge
#define TIMER_CTL_TAEVENT_BOTH  0x0000000C  ///< Both edges
#define TIMER_CTL_TASTALL       0x00000002  ///< GPTM Timer A Stall Enable
#define TIMER_CTL_TAEN          0x00000001  ///< GPTM Timer A Enable
/*\}*/

/**
 * The following are defines for the bit fields in the TIMER_O_IMR register.
 */
/*\{*/
#define TIMER_IMR_CBEIM         0x00000400  ///< GPTM Capture B Event Interrupt
                                            ///< Mask
#define TIMER_IMR_CBMIM         0x00000200  ///< GPTM Capture B Match Interrupt
                                            ///< Mask
#define TIMER_IMR_TBTOIM        0x00000100  ///< GPTM Timer B Time-Out Interrupt
                                            ///< Mask
#define TIMER_IMR_RTCIM         0x00000008  ///< GPTM RTC Interrupt Mask
#define TIMER_IMR_CAEIM         0x00000004  ///< GPTM Capture A Event Interrupt
                                            ///< Mask
#define TIMER_IMR_CAMIM         0x00000002  ///< GPTM Capture A Match Interrupt
                                            ///< Mask
#define TIMER_IMR_TATOIM        0x00000001  ///< GPTM Timer A Time-Out Interrupt
                                            ///< Mask
/*\}*/

/**
 * The following are defines for the bit fields in the TIMER_O_RIS register.
 */
/*\{*/
#define TIMER_RIS_CBERIS        0x00000400  ///< GPTM Capture B Event Raw
                                            ///< Interrupt
#define TIMER_RIS_CBMRIS        0x00000200  ///< GPTM Capture B Match Raw
                                            ///< Interrupt
#define TIMER_RIS_TBTORIS       0x00000100  ///< GPTM Timer B Time-Out Raw
                                            ///< Interrupt
#define TIMER_RIS_RTCRIS        0x00000008  ///< GPTM RTC Raw Interrupt
#define TIMER_RIS_CAERIS        0x00000004  ///< GPTM Capture A Event Raw
                                            ///< Interrupt
#define TIMER_RIS_CAMRIS        0x00000002  ///< GPTM Capture A Match Raw
                                            ///< Interrupt
#define TIMER_RIS_TATORIS       0x00000001  ///< GPTM Timer A Time-Out Raw
                                            ///< Interrupt
/*\}*/

/**
 * The following are defines for the bit fields in the TIMER_O_MIS register.
 */
/*\{*/
#define TIMER_MIS_CBEMIS        0x00000400  ///< GPTM Capture B Event Masked
                                            ///< Interrupt
#define TIMER_MIS_CBMMIS        0x00000200  ///< GPTM Capture B Match Masked
                                            ///< Interrupt
#define TIMER_MIS_TBTOMIS       0x00000100  ///< GPTM Timer B Time-Out Masked
                                            ///< Interrupt
#define TIMER_MIS_RTCMIS        0x00000008  ///< GPTM RTC Masked Interrupt
#define TIMER_MIS_CAEMIS        0x00000004  ///< GPTM Capture A Event Masked
                                            ///< Interrupt
#define TIMER_MIS_CAMMIS        0x00000002  ///< GPTM Capture A Match Masked
                                            ///< Interrupt
#define TIMER_MIS_TATOMIS       0x00000001  ///< GPTM Timer A Time-Out Masked
                                            ///< Interrupt
/*\}*/

/**
 * The following are defines for the bit fields in the TIMER_O_ICR register.
 */
/*\{*/
#define TIMER_ICR_CBECINT       0x00000400  ///< GPTM Capture B Event Interrupt
                                            ///< Clear
#define TIMER_ICR_CBMCINT       0x00000200  ///< GPTM Capture B Match Interrupt
                                            ///< Clear
#define TIMER_ICR_TBTOCINT      0x00000100  ///< GPTM Timer B Time-Out Interrupt
                                            ///< Clear
#define TIMER_ICR_RTCCINT       0x00000008  ///< GPTM RTC Interrupt Clear
#define TIMER_ICR_CAECINT       0x00000004  ///< GPTM Capture A Event Interrupt
                                            ///< Clear
#define TIMER_ICR_CAMCINT       0x00000002  ///< GPTM Capture A Match Interrupt
                                            ///< Clear
#define TIMER_ICR_TATOCINT      0x00000001  ///< GPTM Timer A Time-Out Raw
                                            ///< Interrupt
/*\}*/

/**
 * The following are defines for the bit fields in the TIMER_O_TAILR register.
 */
/*\{*/
#define TIMER_TAILR_TAILRH_M    0xFFFF0000  ///< GPTM Timer A Interval Load
                                            ///< Register High
#define TIMER_TAILR_TAILRL_M    0x0000FFFF  ///< GPTM Timer A Interval Load
                                            ///< Register Low
#define TIMER_TAILR_TAILRH_S    16
#define TIMER_TAILR_TAILRL_S    0
/*\}*/

/**
 * The following are defines for the bit fields in the TIMER_O_TBILR register.
 */
/*\{*/
#define TIMER_TBILR_TBILRL_M    0x0000FFFF  ///< GPTM Timer B Interval Load
                                            ///< Register
#define TIMER_TBILR_TBILRL_S    0
/*\}*/

/**
 * The following are defines for the bit fields in the TIMER_O_TAMATCHR
* register.
 */
/*\{*/
#define TIMER_TAMATCHR_TAMRH_M  0xFFFF0000  ///< GPTM Timer A Match Register High
#define TIMER_TAMATCHR_TAMRL_M  0x0000FFFF  ///< GPTM Timer A Match Register Low
#define TIMER_TAMATCHR_TAMRH_S  16
#define TIMER_TAMATCHR_TAMRL_S  0
/*\}*/

/**
 * The following are defines for the bit fields in the TIMER_O_TBMATCHR
* register.
 */
/*\{*/
#define TIMER_TBMATCHR_TBMRL_M  0x0000FFFF  ///< GPTM Timer B Match Register Low
#define TIMER_TBMATCHR_TBMRL_S  0
/*\}*/

/**
 * The following are defines for the bit fields in the TIMER_O_TAPR register.
 */
/*\{*/
#define TIMER_TAPR_TAPSR_M      0x000000FF  ///< GPTM Timer A Prescale
#define TIMER_TAPR_TAPSR_S      0
/*\}*/

/**
 * The following are defines for the bit fields in the TIMER_O_TBPR register.
 */
/*\{*/
#define TIMER_TBPR_TBPSR_M      0x000000FF  ///< GPTM Timer B Prescale
#define TIMER_TBPR_TBPSR_S      0
/*\}*/

/**
 * The following are defines for the bit fields in the TIMER_O_TAPMR register.
 */
/*\{*/
#define TIMER_TAPMR_TAPSMR_M    0x000000FF  ///< GPTM TimerA Prescale Match
#define TIMER_TAPMR_TAPSMR_S    0
/*\}*/

/**
 * The following are defines for the bit fields in the TIMER_O_TBPMR register.
 */
/*\{*/
#define TIMER_TBPMR_TBPSMR_M    0x000000FF  ///< GPTM TimerB Prescale Match
#define TIMER_TBPMR_TBPSMR_S    0
/*\}*/

/**
 * The following are defines for the bit fields in the TIMER_O_TAR register.
 */
/*\{*/
#define TIMER_TAR_TARH_M        0xFFFF0000  ///< GPTM Timer A Register High
#define TIMER_TAR_TARL_M        0x0000FFFF  ///< GPTM Timer A Register Low
#define TIMER_TAR_TARH_S        16
#define TIMER_TAR_TARL_S        0
/*\}*/

/**
 * The following are defines for the bit fields in the TIMER_O_TBR register.
 */
/*\{*/
#define TIMER_TBR_TBRL_M        0x0000FFFF  ///< GPTM Timer B
#define TIMER_TBR_TBRL_S        0
/*\}*/


/**
 * The following are defines for the bit fields in the COMP_O_ACMIS register.
 */
/*\{*/
#define COMP_ACMIS_IN2          0x00000004  ///< Comparator 2 Masked Interrupt
                                            ///< Status
#define COMP_ACMIS_IN1          0x00000002  ///< Comparator 1 Masked Interrupt
                                            ///< Status
#define COMP_ACMIS_IN0          0x00000001  ///< Comparator 0 Masked Interrupt
                                            ///< Status
/*\}*/

/**
 * The following are defines for the bit fields in the COMP_O_ACRIS register.
 */
/*\{*/
#define COMP_ACRIS_IN2          0x00000004  ///< Comparator 2 Interrupt Status
#define COMP_ACRIS_IN1          0x00000002  ///< Comparator 1 Interrupt Status
#define COMP_ACRIS_IN0          0x00000001  ///< Comparator 0 Interrupt Status
/*\}*/

/**
 * The following are defines for the bit fields in the COMP_O_ACINTEN register.
 */
/*\{*/
#define COMP_ACINTEN_IN2        0x00000004  ///< Comparator 2 Interrupt Enable
#define COMP_ACINTEN_IN1        0x00000002  ///< Comparator 1 Interrupt Enable
#define COMP_ACINTEN_IN0        0x00000001  ///< Comparator 0 Interrupt Enable
/*\}*/

/**
 * The following are defines for the bit fields in the COMP_O_ACREFCTL
* register.
 */
/*\{*/
#define COMP_ACREFCTL_EN        0x00000200  ///< Resistor Ladder Enable
#define COMP_ACREFCTL_RNG       0x00000100  ///< Resistor Ladder Range
#define COMP_ACREFCTL_VREF_M    0x0000000F  ///< Resistor Ladder Voltage Ref
#define COMP_ACREFCTL_VREF_S    0
/*\}*/

/**
 * The following are defines for the bit fields in the COMP_O_ACSTAT0 register.
 */
/*\{*/
#define COMP_ACSTAT0_OVAL       0x00000002  ///< Comparator Output Value
/*\}*/

/**
 * The following are defines for the bit fields in the COMP_O_ACCTL0 register.
 */
/*\{*/
#define COMP_ACCTL0_TOEN        0x00000800  ///< Trigger Output Enable
#define COMP_ACCTL0_ASRCP_M     0x00000600  ///< Analog Source Positive
#define COMP_ACCTL0_ASRCP_PIN   0x00000000  ///< Pin value of Cn+
#define COMP_ACCTL0_ASRCP_PIN0  0x00000200  ///< Pin value of C0+
#define COMP_ACCTL0_ASRCP_REF   0x00000400  ///< Internal voltage reference
                                            ///< (VIREF)
#define COMP_ACCTL0_TSLVAL      0x00000080  ///< Trigger Sense Level Value
#define COMP_ACCTL0_TSEN_M      0x00000060  ///< Trigger Sense
#define COMP_ACCTL0_TSEN_LEVEL  0x00000000  ///< Level sense, see TSLVAL
#define COMP_ACCTL0_TSEN_FALL   0x00000020  ///< Falling edge
#define COMP_ACCTL0_TSEN_RISE   0x00000040  ///< Rising edge
#define COMP_ACCTL0_TSEN_BOTH   0x00000060  ///< Either edge
#define COMP_ACCTL0_ISLVAL      0x00000010  ///< Interrupt Sense Level Value
#define COMP_ACCTL0_ISEN_M      0x0000000C  ///< Interrupt Sense
#define COMP_ACCTL0_ISEN_LEVEL  0x00000000  ///< Level sense, see ISLVAL
#define COMP_ACCTL0_ISEN_FALL   0x00000004  ///< Falling edge
#define COMP_ACCTL0_ISEN_RISE   0x00000008  ///< Rising edge
#define COMP_ACCTL0_ISEN_BOTH   0x0000000C  ///< Either edge
#define COMP_ACCTL0_CINV        0x00000002  ///< Comparator Output Invert
/*\}*/

/**
 * The following are defines for the bit fields in the COMP_O_ACSTAT1 register.
 */
/*\{*/
#define COMP_ACSTAT1_OVAL       0x00000002  ///< Comparator Output Value
/*\}*/

/**
 * The following are defines for the bit fields in the COMP_O_ACCTL1 register.
 */
/*\{*/
#define COMP_ACCTL1_TOEN        0x00000800  ///< Trigger Output Enable
#define COMP_ACCTL1_ASRCP_M     0x00000600  ///< Analog Source Positive
#define COMP_ACCTL1_ASRCP_PIN   0x00000000  ///< Pin value of Cn+
#define COMP_ACCTL1_ASRCP_PIN0  0x00000200  ///< Pin value of C0+
#define COMP_ACCTL1_ASRCP_REF   0x00000400  ///< Internal voltage reference
                                            ///< (VIREF)
#define COMP_ACCTL1_TSLVAL      0x00000080  ///< Trigger Sense Level Value
#define COMP_ACCTL1_TSEN_M      0x00000060  ///< Trigger Sense
#define COMP_ACCTL1_TSEN_LEVEL  0x00000000  ///< Level sense, see TSLVAL
#define COMP_ACCTL1_TSEN_FALL   0x00000020  ///< Falling edge
#define COMP_ACCTL1_TSEN_RISE   0x00000040  ///< Rising edge
#define COMP_ACCTL1_TSEN_BOTH   0x00000060  ///< Either edge
#define COMP_ACCTL1_ISLVAL      0x00000010  ///< Interrupt Sense Level Value
#define COMP_ACCTL1_ISEN_M      0x0000000C  ///< Interrupt Sense
#define COMP_ACCTL1_ISEN_LEVEL  0x00000000  ///< Level sense, see ISLVAL
#define COMP_ACCTL1_ISEN_FALL   0x00000004  ///< Falling edge
#define COMP_ACCTL1_ISEN_RISE   0x00000008  ///< Rising edge
#define COMP_ACCTL1_ISEN_BOTH   0x0000000C  ///< Either edge
#define COMP_ACCTL1_CINV        0x00000002  ///< Comparator Output Invert
/*\}*/

/**
 * The following are defines for the bit fields in the COMP_O_ACSTAT2 register.
 */
/*\{*/
#define COMP_ACSTAT2_OVAL       0x00000002  ///< Comparator Output Value
/*\}*/

/**
 * The following are defines for the bit fields in the COMP_O_ACCTL2 register.
 */
/*\{*/
#define COMP_ACCTL2_TOEN        0x00000800  ///< Trigger Output Enable
#define COMP_ACCTL2_ASRCP_M     0x00000600  ///< Analog Source Positive
#define COMP_ACCTL2_ASRCP_PIN   0x00000000  ///< Pin value of Cn+
#define COMP_ACCTL2_ASRCP_PIN0  0x00000200  ///< Pin value of C0+
#define COMP_ACCTL2_ASRCP_REF   0x00000400  ///< Internal voltage reference
                                            ///< (VIREF)
#define COMP_ACCTL2_TSLVAL      0x00000080  ///< Trigger Sense Level Value
#define COMP_ACCTL2_TSEN_M      0x00000060  ///< Trigger Sense
#define COMP_ACCTL2_TSEN_LEVEL  0x00000000  ///< Level sense, see TSLVAL
#define COMP_ACCTL2_TSEN_FALL   0x00000020  ///< Falling edge
#define COMP_ACCTL2_TSEN_RISE   0x00000040  ///< Rising edge
#define COMP_ACCTL2_TSEN_BOTH   0x00000060  ///< Either edge
#define COMP_ACCTL2_ISLVAL      0x00000010  ///< Interrupt Sense Level Value
#define COMP_ACCTL2_ISEN_M      0x0000000C  ///< Interrupt Sense
#define COMP_ACCTL2_ISEN_LEVEL  0x00000000  ///< Level sense, see ISLVAL
#define COMP_ACCTL2_ISEN_FALL   0x00000004  ///< Falling edge
#define COMP_ACCTL2_ISEN_RISE   0x00000008  ///< Rising edge
#define COMP_ACCTL2_ISEN_BOTH   0x0000000C  ///< Either edge
#define COMP_ACCTL2_CINV        0x00000002  ///< Comparator Output Invert
/*\}*/

/**
 * The following are defines for the bit fields in the HIB_RTCC register.
 */
/*\{*/
#define HIB_RTCC_M              0xFFFFFFFF  ///< RTC Counter
#define HIB_RTCC_S              0
/*\}*/

/**
 * The following are defines for the bit fields in the HIB_RTCM0 register.
 */
/*\{*/
#define HIB_RTCM0_M             0xFFFFFFFF  ///< RTC Match 0
#define HIB_RTCM0_S             0
/*\}*/

/**
 * The following are defines for the bit fields in the HIB_RTCM1 register.
 */
/*\{*/
#define HIB_RTCM1_M             0xFFFFFFFF  ///< RTC Match 1
#define HIB_RTCM1_S             0
/*\}*/

/**
 * The following are defines for the bit fields in the HIB_RTCLD register.
 */
/*\{*/
#define HIB_RTCLD_M             0xFFFFFFFF  ///< RTC Load
#define HIB_RTCLD_S             0
/*\}*/

/**
 * The following are defines for the bit fields in the HIB_CTL register.
 */
/*\{*/
#define HIB_CTL_VABORT          0x00000080  ///< Power Cut Abort Enable
#define HIB_CTL_CLK32EN         0x00000040  ///< Clocking Enable
#define HIB_CTL_LOWBATEN        0x00000020  ///< Low Battery Monitoring Enable
#define HIB_CTL_PINWEN          0x00000010  ///< External WAKE Pin Enable
#define HIB_CTL_RTCWEN          0x00000008  ///< RTC Wake-up Enable
#define HIB_CTL_CLKSEL          0x00000004  ///< Hibernation Module Clock Select
#define HIB_CTL_HIBREQ          0x00000002  ///< Hibernation Request
#define HIB_CTL_RTCEN           0x00000001  ///< RTC Timer Enable
/*\}*/

/**
 * The following are defines for the bit fields in the HIB_IM register.
 */
/*\{*/
#define HIB_IM_EXTW             0x00000008  ///< External Wake-Up Interrupt Mask
#define HIB_IM_LOWBAT           0x00000004  ///< Low Battery Voltage Interrupt
                                            ///< Mask
#define HIB_IM_RTCALT1          0x00000002  ///< RTC Alert 1 Interrupt Mask
#define HIB_IM_RTCALT0          0x00000001  ///< RTC Alert 0 Interrupt Mask
/*\}*/

/**
 * The following are defines for the bit fields in the HIB_RIS register.
 */
/*\{*/
#define HIB_RIS_EXTW            0x00000008  ///< External Wake-Up Raw Interrupt
                                            ///< Status
#define HIB_RIS_LOWBAT          0x00000004  ///< Low Battery Voltage Raw
                                            ///< Interrupt Status
#define HIB_RIS_RTCALT1         0x00000002  ///< RTC Alert 1 Raw Interrupt Status
#define HIB_RIS_RTCALT0         0x00000001  ///< RTC Alert 0 Raw Interrupt Status
/*\}*/

/**
 * The following are defines for the bit fields in the HIB_MIS register.
 */
/*\{*/
#define HIB_MIS_EXTW            0x00000008  ///< External Wake-Up Masked
                                            ///< Interrupt Status
#define HIB_MIS_LOWBAT          0x00000004  ///< Low Battery Voltage Masked
                                            ///< Interrupt Status
#define HIB_MIS_RTCALT1         0x00000002  ///< RTC Alert 1 Masked Interrupt
                                            ///< Status
#define HIB_MIS_RTCALT0         0x00000001  ///< RTC Alert 0 Masked Interrupt
                                            ///< Status
/*\}*/

/**
 * The following are defines for the bit fields in the HIB_IC register.
 */
/*\{*/
#define HIB_IC_EXTW             0x00000008  ///< External Wake-Up Masked
                                            ///< Interrupt Clear
#define HIB_IC_LOWBAT           0x00000004  ///< Low Battery Voltage Masked
                                            ///< Interrupt Clear
#define HIB_IC_RTCALT1          0x00000002  ///< RTC Alert1 Masked Interrupt
                                            ///< Clear
#define HIB_IC_RTCALT0          0x00000001  ///< RTC Alert0 Masked Interrupt
                                            ///< Clear
/*\}*/

/**
 * The following are defines for the bit fields in the HIB_RTCT register.
 */
/*\{*/
#define HIB_RTCT_TRIM_M         0x0000FFFF  ///< RTC Trim Value
#define HIB_RTCT_TRIM_S         0
/*\}*/

/**
 * The following are defines for the bit fields in the HIB_DATA register.
 */
/*\{*/
#define HIB_DATA_RTD_M          0xFFFFFFFF  ///< Hibernation Module NV Data
#define HIB_DATA_RTD_S          0
/*\}*/

/**
 * The following are defines for the bit fields in the FLASH_FMA register.
 */
/*\{*/
#define FLASH_FMA_OFFSET_M      0x0003FFFF  ///< Address Offset
#define FLASH_FMA_OFFSET_S      0
/*\}*/

/**
 * The following are defines for the bit fields in the FLASH_FMD register.
 */
/*\{*/
#define FLASH_FMD_DATA_M        0xFFFFFFFF  ///< Data Value
#define FLASH_FMD_DATA_S        0
/*\}*/

/**
 * The following are defines for the bit fields in the FLASH_FMC register.
 */
/*\{*/
#define FLASH_FMC_WRKEY         0xA4420000  ///< FLASH write key
#define FLASH_FMC_COMT          0x00000008  ///< Commit Register Value
#define FLASH_FMC_MERASE        0x00000004  ///< Mass Erase Flash Memory
#define FLASH_FMC_ERASE         0x00000002  ///< Erase a Page of Flash Memory
#define FLASH_FMC_WRITE         0x00000001  ///< Write a Word into Flash Memory
/*\}*/

/**
 * The following are defines for the bit fields in the FLASH_FCRIS register.
 */
/*\{*/
#define FLASH_FCRIS_PRIS        0x00000002  ///< Programming Raw Interrupt Status
#define FLASH_FCRIS_ARIS        0x00000001  ///< Access Raw Interrupt Status
/*\}*/

/**
 * The following are defines for the bit fields in the FLASH_FCIM register.
 */
/*\{*/
#define FLASH_FCIM_PMASK        0x00000002  ///< Programming Interrupt Mask
#define FLASH_FCIM_AMASK        0x00000001  ///< Access Interrupt Mask
/*\}*/

/**
 * The following are defines for the bit fields in the FLASH_FCMISC register.
 */
/*\{*/
#define FLASH_FCMISC_PMISC      0x00000002  ///< Programming Masked Interrupt
                                            ///< Status and Clear
#define FLASH_FCMISC_AMISC      0x00000001  ///< Access Masked Interrupt Status
                                            ///< and Clear
/*\}*/

