markqvist/MicroAPRS/bertos/cpu/cortex-m3/io/lm3s_com.h
/**
 * The following are defines for the bit fields in the FLASH_USECRL register.
 */
/*\{*/
#define FLASH_USECRL_M          0x000000FF  ///< Microsecond Reload Value
#define FLASH_USECRL_S          0
/*\}*/

/**
 * The following are defines for the bit fields in the FLASH_USERDBG register.
 */
/*\{*/
#define FLASH_USERDBG_NW        0x80000000  ///< User Debug Not Written
#define FLASH_USERDBG_DATA_M    0x7FFFFFFC  ///< User Data
#define FLASH_USERDBG_DBG1      0x00000002  ///< Debug Control 1
#define FLASH_USERDBG_DBG0      0x00000001  ///< Debug Control 0
#define FLASH_USERDBG_DATA_S    2
/*\}*/

/**
 * The following are defines for the bit fields in the FLASH_USERREG0 register.
 */
/*\{*/
#define FLASH_USERREG0_NW       0x80000000  ///< Not Written
#define FLASH_USERREG0_DATA_M   0x7FFFFFFF  ///< User Data
#define FLASH_USERREG0_DATA_S   0
/*\}*/

/**
 * The following are defines for the bit fields in the FLASH_USERREG1 register.
 */
/*\{*/
#define FLASH_USERREG1_NW       0x80000000  ///< Not Written
#define FLASH_USERREG1_DATA_M   0x7FFFFFFF  ///< User Data
#define FLASH_USERREG1_DATA_S   0
/*\}*/

/**
 * The following are defines for the erase size of the FLASH block that is
* erased by an erase operation, and the protect size is the size of the FLASH
* block that is protected by each protection register.
 */
/*\{*/
#define FLASH_PROTECT_SIZE      0x00000800
#define FLASH_ERASE_SIZE        0x00000400
/*\}*/

/**
 * The following are defines for the bit fields in the NVIC_INT_TYPE register.
 */
/*\{*/
#define NVIC_INT_TYPE_LINES_M   0x0000001F  ///< Number of interrupt lines (x32)
#define NVIC_INT_TYPE_LINES_S   0
/*\}*/

/**
 * The following are defines for the bit fields in the NVIC_ST_CTRL register.
 */
/*\{*/
#define NVIC_ST_CTRL_COUNT      0x00010000  ///< Count flag
#define NVIC_ST_CTRL_CLK_SRC    0x00000004  ///< Clock Source
#define NVIC_ST_CTRL_INTEN      0x00000002  ///< Interrupt enable
#define NVIC_ST_CTRL_ENABLE     0x00000001  ///< Counter mode
/*\}*/

/**
 * The following are defines for the bit fields in the NVIC_ST_RELOAD register.
 */
/*\{*/
#define NVIC_ST_RELOAD_M        0x00FFFFFF  ///< Counter load value
#define NVIC_ST_RELOAD_S        0
/*\}*/

/**
 * The following are defines for the bit fields in the NVIC_ST_CURRENT
* register.
 */
/*\{*/
#define NVIC_ST_CURRENT_M       0x00FFFFFF  ///< Counter current value
#define NVIC_ST_CURRENT_S       0
/*\}*/

/**
 * The following are defines for the bit fields in the NVIC_ST_CAL register.
 */
/*\{*/
#define NVIC_ST_CAL_NOREF       0x80000000  ///< No reference clock
#define NVIC_ST_CAL_SKEW        0x40000000  ///< Clock skew
#define NVIC_ST_CAL_ONEMS_M     0x00FFFFFF  ///< 1ms reference value
#define NVIC_ST_CAL_ONEMS_S     0
/*\}*/

/**
 * The following are defines for the bit fields in the NVIC_EN0 register.
 */
/*\{*/
#define NVIC_EN0_INT31          0x80000000  ///< Interrupt 31 enable
#define NVIC_EN0_INT30          0x40000000  ///< Interrupt 30 enable
#define NVIC_EN0_INT29          0x20000000  ///< Interrupt 29 enable
#define NVIC_EN0_INT28          0x10000000  ///< Interrupt 28 enable
#define NVIC_EN0_INT27          0x08000000  ///< Interrupt 27 enable
#define NVIC_EN0_INT26          0x04000000  ///< Interrupt 26 enable
#define NVIC_EN0_INT25          0x02000000  ///< Interrupt 25 enable
#define NVIC_EN0_INT24          0x01000000  ///< Interrupt 24 enable
#define NVIC_EN0_INT23          0x00800000  ///< Interrupt 23 enable
#define NVIC_EN0_INT22          0x00400000  ///< Interrupt 22 enable
#define NVIC_EN0_INT21          0x00200000  ///< Interrupt 21 enable
#define NVIC_EN0_INT20          0x00100000  ///< Interrupt 20 enable
#define NVIC_EN0_INT19          0x00080000  ///< Interrupt 19 enable
#define NVIC_EN0_INT18          0x00040000  ///< Interrupt 18 enable
#define NVIC_EN0_INT17          0x00020000  ///< Interrupt 17 enable
#define NVIC_EN0_INT16          0x00010000  ///< Interrupt 16 enable
#define NVIC_EN0_INT15          0x00008000  ///< Interrupt 15 enable
#define NVIC_EN0_INT14          0x00004000  ///< Interrupt 14 enable
#define NVIC_EN0_INT13          0x00002000  ///< Interrupt 13 enable
#define NVIC_EN0_INT12          0x00001000  ///< Interrupt 12 enable
#define NVIC_EN0_INT11          0x00000800  ///< Interrupt 11 enable
#define NVIC_EN0_INT10          0x00000400  ///< Interrupt 10 enable
#define NVIC_EN0_INT9           0x00000200  ///< Interrupt 9 enable
#define NVIC_EN0_INT8           0x00000100  ///< Interrupt 8 enable
#define NVIC_EN0_INT7           0x00000080  ///< Interrupt 7 enable
#define NVIC_EN0_INT6           0x00000040  ///< Interrupt 6 enable
#define NVIC_EN0_INT5           0x00000020  ///< Interrupt 5 enable
#define NVIC_EN0_INT4           0x00000010  ///< Interrupt 4 enable
#define NVIC_EN0_INT3           0x00000008  ///< Interrupt 3 enable
#define NVIC_EN0_INT2           0x00000004  ///< Interrupt 2 enable
#define NVIC_EN0_INT1           0x00000002  ///< Interrupt 1 enable
#define NVIC_EN0_INT0           0x00000001  ///< Interrupt 0 enable
/*\}*/

/**
 * The following are defines for the bit fields in the NVIC_EN1 register.
 */
/*\{*/
#define NVIC_EN1_INT59          0x08000000  ///< Interrupt 59 enable
#define NVIC_EN1_INT58          0x04000000  ///< Interrupt 58 enable
#define NVIC_EN1_INT57          0x02000000  ///< Interrupt 57 enable
#define NVIC_EN1_INT56          0x01000000  ///< Interrupt 56 enable
#define NVIC_EN1_INT55          0x00800000  ///< Interrupt 55 enable
#define NVIC_EN1_INT54          0x00400000  ///< Interrupt 54 enable
#define NVIC_EN1_INT53          0x00200000  ///< Interrupt 53 enable
#define NVIC_EN1_INT52          0x00100000  ///< Interrupt 52 enable
#define NVIC_EN1_INT51          0x00080000  ///< Interrupt 51 enable
#define NVIC_EN1_INT50          0x00040000  ///< Interrupt 50 enable
#define NVIC_EN1_INT49          0x00020000  ///< Interrupt 49 enable
#define NVIC_EN1_INT48          0x00010000  ///< Interrupt 48 enable
#define NVIC_EN1_INT47          0x00008000  ///< Interrupt 47 enable
#define NVIC_EN1_INT46          0x00004000  ///< Interrupt 46 enable
#define NVIC_EN1_INT45          0x00002000  ///< Interrupt 45 enable
#define NVIC_EN1_INT44          0x00001000  ///< Interrupt 44 enable
#define NVIC_EN1_INT43          0x00000800  ///< Interrupt 43 enable
#define NVIC_EN1_INT42          0x00000400  ///< Interrupt 42 enable
#define NVIC_EN1_INT41          0x00000200  ///< Interrupt 41 enable
#define NVIC_EN1_INT40          0x00000100  ///< Interrupt 40 enable
#define NVIC_EN1_INT39          0x00000080  ///< Interrupt 39 enable
#define NVIC_EN1_INT38          0x00000040  ///< Interrupt 38 enable
#define NVIC_EN1_INT37          0x00000020  ///< Interrupt 37 enable
#define NVIC_EN1_INT36          0x00000010  ///< Interrupt 36 enable
#define NVIC_EN1_INT35          0x00000008  ///< Interrupt 35 enable
#define NVIC_EN1_INT34          0x00000004  ///< Interrupt 34 enable
#define NVIC_EN1_INT33          0x00000002  ///< Interrupt 33 enable
#define NVIC_EN1_INT32          0x00000001  ///< Interrupt 32 enable
/*\}*/

/**
 * The following are defines for the bit fields in the NVIC_DIS0 register.
 */
/*\{*/
#define NVIC_DIS0_INT31         0x80000000  ///< Interrupt 31 disable
#define NVIC_DIS0_INT30         0x40000000  ///< Interrupt 30 disable
#define NVIC_DIS0_INT29         0x20000000  ///< Interrupt 29 disable
#define NVIC_DIS0_INT28         0x10000000  ///< Interrupt 28 disable
#define NVIC_DIS0_INT27         0x08000000  ///< Interrupt 27 disable
#define NVIC_DIS0_INT26         0x04000000  ///< Interrupt 26 disable
#define NVIC_DIS0_INT25         0x02000000  ///< Interrupt 25 disable
#define NVIC_DIS0_INT24         0x01000000  ///< Interrupt 24 disable
#define NVIC_DIS0_INT23         0x00800000  ///< Interrupt 23 disable
#define NVIC_DIS0_INT22         0x00400000  ///< Interrupt 22 disable
#define NVIC_DIS0_INT21         0x00200000  ///< Interrupt 21 disable
#define NVIC_DIS0_INT20         0x00100000  ///< Interrupt 20 disable
#define NVIC_DIS0_INT19         0x00080000  ///< Interrupt 19 disable
#define NVIC_DIS0_INT18         0x00040000  ///< Interrupt 18 disable
#define NVIC_DIS0_INT17         0x00020000  ///< Interrupt 17 disable
#define NVIC_DIS0_INT16         0x00010000  ///< Interrupt 16 disable
#define NVIC_DIS0_INT15         0x00008000  ///< Interrupt 15 disable
#define NVIC_DIS0_INT14         0x00004000  ///< Interrupt 14 disable
#define NVIC_DIS0_INT13         0x00002000  ///< Interrupt 13 disable
#define NVIC_DIS0_INT12         0x00001000  ///< Interrupt 12 disable
#define NVIC_DIS0_INT11         0x00000800  ///< Interrupt 11 disable
#define NVIC_DIS0_INT10         0x00000400  ///< Interrupt 10 disable
#define NVIC_DIS0_INT9          0x00000200  ///< Interrupt 9 disable
#define NVIC_DIS0_INT8          0x00000100  ///< Interrupt 8 disable
#define NVIC_DIS0_INT7          0x00000080  ///< Interrupt 7 disable
#define NVIC_DIS0_INT6          0x00000040  ///< Interrupt 6 disable
#define NVIC_DIS0_INT5          0x00000020  ///< Interrupt 5 disable
#define NVIC_DIS0_INT4          0x00000010  ///< Interrupt 4 disable
#define NVIC_DIS0_INT3          0x00000008  ///< Interrupt 3 disable
#define NVIC_DIS0_INT2          0x00000004  ///< Interrupt 2 disable
#define NVIC_DIS0_INT1          0x00000002  ///< Interrupt 1 disable
#define NVIC_DIS0_INT0          0x00000001  ///< Interrupt 0 disable
/*\}*/

/**
 * The following are defines for the bit fields in the NVIC_DIS1 register.
 */
/*\{*/
#define NVIC_DIS1_INT59         0x08000000  ///< Interrupt 59 disable
#define NVIC_DIS1_INT58         0x04000000  ///< Interrupt 58 disable
#define NVIC_DIS1_INT57         0x02000000  ///< Interrupt 57 disable
#define NVIC_DIS1_INT56         0x01000000  ///< Interrupt 56 disable
#define NVIC_DIS1_INT55         0x00800000  ///< Interrupt 55 disable
#define NVIC_DIS1_INT54         0x00400000  ///< Interrupt 54 disable
#define NVIC_DIS1_INT53         0x00200000  ///< Interrupt 53 disable
#define NVIC_DIS1_INT52         0x00100000  ///< Interrupt 52 disable
#define NVIC_DIS1_INT51         0x00080000  ///< Interrupt 51 disable
#define NVIC_DIS1_INT50         0x00040000  ///< Interrupt 50 disable
#define NVIC_DIS1_INT49         0x00020000  ///< Interrupt 49 disable
#define NVIC_DIS1_INT48         0x00010000  ///< Interrupt 48 disable
#define NVIC_DIS1_INT47         0x00008000  ///< Interrupt 47 disable
#define NVIC_DIS1_INT46         0x00004000  ///< Interrupt 46 disable
#define NVIC_DIS1_INT45         0x00002000  ///< Interrupt 45 disable
#define NVIC_DIS1_INT44         0x00001000  ///< Interrupt 44 disable
#define NVIC_DIS1_INT43         0x00000800  ///< Interrupt 43 disable
#define NVIC_DIS1_INT42         0x00000400  ///< Interrupt 42 disable
#define NVIC_DIS1_INT41         0x00000200  ///< Interrupt 41 disable
#define NVIC_DIS1_INT40         0x00000100  ///< Interrupt 40 disable
#define NVIC_DIS1_INT39         0x00000080  ///< Interrupt 39 disable
#define NVIC_DIS1_INT38         0x00000040  ///< Interrupt 38 disable
#define NVIC_DIS1_INT37         0x00000020  ///< Interrupt 37 disable
#define NVIC_DIS1_INT36         0x00000010  ///< Interrupt 36 disable
#define NVIC_DIS1_INT35         0x00000008  ///< Interrupt 35 disable
#define NVIC_DIS1_INT34         0x00000004  ///< Interrupt 34 disable
#define NVIC_DIS1_INT33         0x00000002  ///< Interrupt 33 disable
#define NVIC_DIS1_INT32         0x00000001  ///< Interrupt 32 disable
/*\}*/

/**
 * The following are defines for the bit fields in the NVIC_PEND0 register.
 */
/*\{*/
#define NVIC_PEND0_INT31        0x80000000  ///< Interrupt 31 pend
#define NVIC_PEND0_INT30        0x40000000  ///< Interrupt 30 pend
#define NVIC_PEND0_INT29        0x20000000  ///< Interrupt 29 pend
#define NVIC_PEND0_INT28        0x10000000  ///< Interrupt 28 pend
#define NVIC_PEND0_INT27        0x08000000  ///< Interrupt 27 pend
#define NVIC_PEND0_INT26        0x04000000  ///< Interrupt 26 pend
#define NVIC_PEND0_INT25        0x02000000  ///< Interrupt 25 pend
#define NVIC_PEND0_INT24        0x01000000  ///< Interrupt 24 pend
#define NVIC_PEND0_INT23        0x00800000  ///< Interrupt 23 pend
#define NVIC_PEND0_INT22        0x00400000  ///< Interrupt 22 pend
#define NVIC_PEND0_INT21        0x00200000  ///< Interrupt 21 pend
#define NVIC_PEND0_INT20        0x00100000  ///< Interrupt 20 pend
#define NVIC_PEND0_INT19        0x00080000  ///< Interrupt 19 pend
#define NVIC_PEND0_INT18        0x00040000  ///< Interrupt 18 pend
#define NVIC_PEND0_INT17        0x00020000  ///< Interrupt 17 pend
#define NVIC_PEND0_INT16        0x00010000  ///< Interrupt 16 pend
#define NVIC_PEND0_INT15        0x00008000  ///< Interrupt 15 pend
#define NVIC_PEND0_INT14        0x00004000  ///< Interrupt 14 pend
#define NVIC_PEND0_INT13        0x00002000  ///< Interrupt 13 pend
#define NVIC_PEND0_INT12        0x00001000  ///< Interrupt 12 pend
#define NVIC_PEND0_INT11        0x00000800  ///< Interrupt 11 pend
#define NVIC_PEND0_INT10        0x00000400  ///< Interrupt 10 pend
#define NVIC_PEND0_INT9         0x00000200  ///< Interrupt 9 pend
#define NVIC_PEND0_INT8         0x00000100  ///< Interrupt 8 pend
#define NVIC_PEND0_INT7         0x00000080  ///< Interrupt 7 pend
#define NVIC_PEND0_INT6         0x00000040  ///< Interrupt 6 pend
#define NVIC_PEND0_INT5         0x00000020  ///< Interrupt 5 pend
#define NVIC_PEND0_INT4         0x00000010  ///< Interrupt 4 pend
#define NVIC_PEND0_INT3         0x00000008  ///< Interrupt 3 pend
#define NVIC_PEND0_INT2         0x00000004  ///< Interrupt 2 pend
#define NVIC_PEND0_INT1         0x00000002  ///< Interrupt 1 pend
#define NVIC_PEND0_INT0         0x00000001  ///< Interrupt 0 pend
/*\}*/

/**
 * The following are defines for the bit fields in the NVIC_PEND1 register.
 */
/*\{*/
#define NVIC_PEND1_INT59        0x08000000  ///< Interrupt 59 pend
#define NVIC_PEND1_INT58        0x04000000  ///< Interrupt 58 pend
#define NVIC_PEND1_INT57        0x02000000  ///< Interrupt 57 pend
#define NVIC_PEND1_INT56        0x01000000  ///< Interrupt 56 pend
#define NVIC_PEND1_INT55        0x00800000  ///< Interrupt 55 pend
#define NVIC_PEND1_INT54        0x00400000  ///< Interrupt 54 pend
#define NVIC_PEND1_INT53        0x00200000  ///< Interrupt 53 pend
#define NVIC_PEND1_INT52        0x00100000  ///< Interrupt 52 pend
#define NVIC_PEND1_INT51        0x00080000  ///< Interrupt 51 pend
#define NVIC_PEND1_INT50        0x00040000  ///< Interrupt 50 pend
#define NVIC_PEND1_INT49        0x00020000  ///< Interrupt 49 pend
#define NVIC_PEND1_INT48        0x00010000  ///< Interrupt 48 pend
#define NVIC_PEND1_INT47        0x00008000  ///< Interrupt 47 pend
#define NVIC_PEND1_INT46        0x00004000  ///< Interrupt 46 pend
#define NVIC_PEND1_INT45        0x00002000  ///< Interrupt 45 pend
#define NVIC_PEND1_INT44        0x00001000  ///< Interrupt 44 pend
#define NVIC_PEND1_INT43        0x00000800  ///< Interrupt 43 pend
#define NVIC_PEND1_INT42        0x00000400  ///< Interrupt 42 pend
#define NVIC_PEND1_INT41        0x00000200  ///< Interrupt 41 pend
#define NVIC_PEND1_INT40        0x00000100  ///< Interrupt 40 pend
#define NVIC_PEND1_INT39        0x00000080  ///< Interrupt 39 pend
#define NVIC_PEND1_INT38        0x00000040  ///< Interrupt 38 pend
#define NVIC_PEND1_INT37        0x00000020  ///< Interrupt 37 pend
#define NVIC_PEND1_INT36        0x00000010  ///< Interrupt 36 pend
#define NVIC_PEND1_INT35        0x00000008  ///< Interrupt 35 pend
#define NVIC_PEND1_INT34        0x00000004  ///< Interrupt 34 pend
#define NVIC_PEND1_INT33        0x00000002  ///< Interrupt 33 pend
#define NVIC_PEND1_INT32        0x00000001  ///< Interrupt 32 pend
/*\}*/

/**
 * The following are defines for the bit fields in the NVIC_UNPEND0 register.
 */
/*\{*/
#define NVIC_UNPEND0_INT31      0x80000000  ///< Interrupt 31 unpend
#define NVIC_UNPEND0_INT30      0x40000000  ///< Interrupt 30 unpend
#define NVIC_UNPEND0_INT29      0x20000000  ///< Interrupt 29 unpend
#define NVIC_UNPEND0_INT28      0x10000000  ///< Interrupt 28 unpend
#define NVIC_UNPEND0_INT27      0x08000000  ///< Interrupt 27 unpend
#define NVIC_UNPEND0_INT26      0x04000000  ///< Interrupt 26 unpend
#define NVIC_UNPEND0_INT25      0x02000000  ///< Interrupt 25 unpend
#define NVIC_UNPEND0_INT24      0x01000000  ///< Interrupt 24 unpend
#define NVIC_UNPEND0_INT23      0x00800000  ///< Interrupt 23 unpend
#define NVIC_UNPEND0_INT22      0x00400000  ///< Interrupt 22 unpend
#define NVIC_UNPEND0_INT21      0x00200000  ///< Interrupt 21 unpend
#define NVIC_UNPEND0_INT20      0x00100000  ///< Interrupt 20 unpend
#define NVIC_UNPEND0_INT19      0x00080000  ///< Interrupt 19 unpend
#define NVIC_UNPEND0_INT18      0x00040000  ///< Interrupt 18 unpend
#define NVIC_UNPEND0_INT17      0x00020000  ///< Interrupt 17 unpend
#define NVIC_UNPEND0_INT16      0x00010000  ///< Interrupt 16 unpend
#define NVIC_UNPEND0_INT15      0x00008000  ///< Interrupt 15 unpend
#define NVIC_UNPEND0_INT14      0x00004000  ///< Interrupt 14 unpend
#define NVIC_UNPEND0_INT13      0x00002000  ///< Interrupt 13 unpend
#define NVIC_UNPEND0_INT12      0x00001000  ///< Interrupt 12 unpend
#define NVIC_UNPEND0_INT11      0x00000800  ///< Interrupt 11 unpend
#define NVIC_UNPEND0_INT10      0x00000400  ///< Interrupt 10 unpend
#define NVIC_UNPEND0_INT9       0x00000200  ///< Interrupt 9 unpend
#define NVIC_UNPEND0_INT8       0x00000100  ///< Interrupt 8 unpend
#define NVIC_UNPEND0_INT7       0x00000080  ///< Interrupt 7 unpend
#define NVIC_UNPEND0_INT6       0x00000040  ///< Interrupt 6 unpend
#define NVIC_UNPEND0_INT5       0x00000020  ///< Interrupt 5 unpend
#define NVIC_UNPEND0_INT4       0x00000010  ///< Interrupt 4 unpend
#define NVIC_UNPEND0_INT3       0x00000008  ///< Interrupt 3 unpend
#define NVIC_UNPEND0_INT2       0x00000004  ///< Interrupt 2 unpend
#define NVIC_UNPEND0_INT1       0x00000002  ///< Interrupt 1 unpend
#define NVIC_UNPEND0_INT0       0x00000001  ///< Interrupt 0 unpend
/*\}*/

/**
 * The following are defines for the bit fields in the NVIC_UNPEND1 register.
 */
/*\{*/
#define NVIC_UNPEND1_INT59      0x08000000  ///< Interrupt 59 unpend
#define NVIC_UNPEND1_INT58      0x04000000  ///< Interrupt 58 unpend
#define NVIC_UNPEND1_INT57      0x02000000  ///< Interrupt 57 unpend
#define NVIC_UNPEND1_INT56      0x01000000  ///< Interrupt 56 unpend
#define NVIC_UNPEND1_INT55      0x00800000  ///< Interrupt 55 unpend
#define NVIC_UNPEND1_INT54      0x00400000  ///< Interrupt 54 unpend
#define NVIC_UNPEND1_INT53      0x00200000  ///< Interrupt 53 unpend
#define NVIC_UNPEND1_INT52      0x00100000  ///< Interrupt 52 unpend
#define NVIC_UNPEND1_INT51      0x00080000  ///< Interrupt 51 unpend
#define NVIC_UNPEND1_INT50      0x00040000  ///< Interrupt 50 unpend
#define NVIC_UNPEND1_INT49      0x00020000  ///< Interrupt 49 unpend
#define NVIC_UNPEND1_INT48      0x00010000  ///< Interrupt 48 unpend
#define NVIC_UNPEND1_INT47      0x00008000  ///< Interrupt 47 unpend
#define NVIC_UNPEND1_INT46      0x00004000  ///< Interrupt 46 unpend
#define NVIC_UNPEND1_INT45      0x00002000  ///< Interrupt 45 unpend
#define NVIC_UNPEND1_INT44      0x00001000  ///< Interrupt 44 unpend
#define NVIC_UNPEND1_INT43      0x00000800  ///< Interrupt 43 unpend
#define NVIC_UNPEND1_INT42      0x00000400  ///< Interrupt 42 unpend
#define NVIC_UNPEND1_INT41      0x00000200  ///< Interrupt 41 unpend
#define NVIC_UNPEND1_INT40      0x00000100  ///< Interrupt 40 unpend
#define NVIC_UNPEND1_INT39      0x00000080  ///< Interrupt 39 unpend
#define NVIC_UNPEND1_INT38      0x00000040  ///< Interrupt 38 unpend
#define NVIC_UNPEND1_INT37      0x00000020  ///< Interrupt 37 unpend
#define NVIC_UNPEND1_INT36      0x00000010  ///< Interrupt 36 unpend
#define NVIC_UNPEND1_INT35      0x00000008  ///< Interrupt 35 unpend
#define NVIC_UNPEND1_INT34      0x00000004  ///< Interrupt 34 unpend
#define NVIC_UNPEND1_INT33      0x00000002  ///< Interrupt 33 unpend
#define NVIC_UNPEND1_INT32      0x00000001  ///< Interrupt 32 unpend
/*\}*/

/**
 * The following are defines for the bit fields in the NVIC_ACTIVE0 register.
 */
/*\{*/
#define NVIC_ACTIVE0_INT31      0x80000000  ///< Interrupt 31 active
#define NVIC_ACTIVE0_INT30      0x40000000  ///< Interrupt 30 active
#define NVIC_ACTIVE0_INT29      0x20000000  ///< Interrupt 29 active
#define NVIC_ACTIVE0_INT28      0x10000000  ///< Interrupt 28 active
#define NVIC_ACTIVE0_INT27      0x08000000  ///< Interrupt 27 active
#define NVIC_ACTIVE0_INT26      0x04000000  ///< Interrupt 26 active
#define NVIC_ACTIVE0_INT25      0x02000000  ///< Interrupt 25 active
#define NVIC_ACTIVE0_INT24      0x01000000  ///< Interrupt 24 active
#define NVIC_ACTIVE0_INT23      0x00800000  ///< Interrupt 23 active
#define NVIC_ACTIVE0_INT22      0x00400000  ///< Interrupt 22 active
#define NVIC_ACTIVE0_INT21      0x00200000  ///< Interrupt 21 active
#define NVIC_ACTIVE0_INT20      0x00100000  ///< Interrupt 20 active
#define NVIC_ACTIVE0_INT19      0x00080000  ///< Interrupt 19 active
#define NVIC_ACTIVE0_INT18      0x00040000  ///< Interrupt 18 active
#define NVIC_ACTIVE0_INT17      0x00020000  ///< Interrupt 17 active
#define NVIC_ACTIVE0_INT16      0x00010000  ///< Interrupt 16 active
#define NVIC_ACTIVE0_INT15      0x00008000  ///< Interrupt 15 active
#define NVIC_ACTIVE0_INT14      0x00004000  ///< Interrupt 14 active
#define NVIC_ACTIVE0_INT13      0x00002000  ///< Interrupt 13 active
#define NVIC_ACTIVE0_INT12      0x00001000  ///< Interrupt 12 active
#define NVIC_ACTIVE0_INT11      0x00000800  ///< Interrupt 11 active
#define NVIC_ACTIVE0_INT10      0x00000400  ///< Interrupt 10 active
#define NVIC_ACTIVE0_INT9       0x00000200  ///< Interrupt 9 active
#define NVIC_ACTIVE0_INT8       0x00000100  ///< Interrupt 8 active
#define NVIC_ACTIVE0_INT7       0x00000080  ///< Interrupt 7 active
#define NVIC_ACTIVE0_INT6       0x00000040  ///< Interrupt 6 active
#define NVIC_ACTIVE0_INT5       0x00000020  ///< Interrupt 5 active
#define NVIC_ACTIVE0_INT4       0x00000010  ///< Interrupt 4 active
#define NVIC_ACTIVE0_INT3       0x00000008  ///< Interrupt 3 active
#define NVIC_ACTIVE0_INT2       0x00000004  ///< Interrupt 2 active
#define NVIC_ACTIVE0_INT1       0x00000002  ///< Interrupt 1 active
#define NVIC_ACTIVE0_INT0       0x00000001  ///< Interrupt 0 active
/*\}*/

