markqvist/MicroAPRS/bertos/cpu/cortex-m3/io/lm3s_com.h
/**
 * The following are defines for the bit fields in the NVIC_DBG_DATA register.
 */
/*\{*/
#define NVIC_DBG_DATA_M         0xFFFFFFFF  ///< Data temporary cache
#define NVIC_DBG_DATA_S         0
/*\}*/

/**
 * The following are defines for the bit fields in the NVIC_DBG_INT register.
 */
/*\{*/
#define NVIC_DBG_INT_HARDERR    0x00000400  ///< Debug trap on hard fault
#define NVIC_DBG_INT_INTERR     0x00000200  ///< Debug trap on interrupt errors
#define NVIC_DBG_INT_BUSERR     0x00000100  ///< Debug trap on bus error
#define NVIC_DBG_INT_STATERR    0x00000080  ///< Debug trap on usage fault state
#define NVIC_DBG_INT_CHKERR     0x00000040  ///< Debug trap on usage fault check
#define NVIC_DBG_INT_NOCPERR    0x00000020  ///< Debug trap on coprocessor error
#define NVIC_DBG_INT_MMERR      0x00000010  ///< Debug trap on mem manage fault
#define NVIC_DBG_INT_RESET      0x00000008  ///< Core reset status
#define NVIC_DBG_INT_RSTPENDCLR 0x00000004  ///< Clear pending core reset
#define NVIC_DBG_INT_RSTPENDING 0x00000002  ///< Core reset is pending
#define NVIC_DBG_INT_RSTVCATCH  0x00000001  ///< Reset vector catch
/*\}*/

/**
 * The following are defines for the bit fields in the NVIC_SW_TRIG register.
 */
/*\{*/
#define NVIC_SW_TRIG_INTID_M    0x000003FF  ///< Interrupt to trigger
#define NVIC_SW_TRIG_INTID_S    0
/*\}*/

/**
 * The following definitions are deprecated.
 */
#ifndef DEPRECATED

/**
 * Deprecated defines for the Watchdog
 */
/*\{*/
#define WATCHDOG_LOAD_R         (*((reg32_t *)0x40000000))
#define WATCHDOG_VALUE_R        (*((reg32_t *)0x40000004))
#define WATCHDOG_CTL_R          (*((reg32_t *)0x40000008))
#define WATCHDOG_ICR_R          (*((reg32_t *)0x4000000C))
#define WATCHDOG_RIS_R          (*((reg32_t *)0x40000010))
#define WATCHDOG_MIS_R          (*((reg32_t *)0x40000014))
#define WATCHDOG_TEST_R         (*((reg32_t *)0x40000418))
#define WATCHDOG_LOCK_R         (*((reg32_t *)0x40000C00))
/*\}*/

/**
 * Deprecated defines for the bit fields in the I2C_O_SICR register.
 */
/*\{*/
#define I2C_SICR_IC             0x00000001  ///< Clear Interrupt
/*\}*/

/**
 * Deprecated defines for the bit fields in the I2C_O_SMIS register.
 */
/*\{*/
#define I2C_SMIS_MIS            0x00000001  ///< Masked Interrupt Status
/*\}*/

/**
 * Deprecated defines for the bit fields in the I2C_O_SRIS register.
 */
/*\{*/
#define I2C_SRIS_RIS            0x00000001  ///< Raw Interrupt Status
/*\}*/

/**
 * Deprecated defines for the bit fields in the I2C_O_SIMR register.
 */
/*\{*/
#define I2C_SIMR_IM             0x00000001  ///< Interrupt Mask
/*\}*/

/**
 * Deprecated defines for the bit fields in the the interpretation of the data
* in the SSFIFOx when the ADC TMLB is enabled. register.
 */
/*\{*/
#define ADC_TMLB_CNT_M          0x000003C0  ///< Continuous Sample Counter
#define ADC_TMLB_CONT           0x00000020  ///< Continuation Sample Indicator
#define ADC_TMLB_DIFF           0x00000010  ///< Differential Sample Indicator
#define ADC_TMLB_TS             0x00000008  ///< Temp Sensor Sample Indicator
#define ADC_TMLB_MUX_M          0x00000007  ///< Analog Input Indicator
#define ADC_TMLB_CNT_S          6           ///< Sample counter shift
#define ADC_TMLB_MUX_S          0           ///< Input channel number shift
/*\}*/

/**
 * Deprecated defines for the ADC register offsets.
 */
/*\{*/
#define ADC_ACTSS_R             (*((reg32_t *)0x40038000))
#define ADC_RIS_R               (*((reg32_t *)0x40038004))
#define ADC_IM_R                (*((reg32_t *)0x40038008))
#define ADC_ISC_R               (*((reg32_t *)0x4003800C))
#define ADC_OSTAT_R             (*((reg32_t *)0x40038010))
#define ADC_EMUX_R              (*((reg32_t *)0x40038014))
#define ADC_USTAT_R             (*((reg32_t *)0x40038018))
#define ADC_SSPRI_R             (*((reg32_t *)0x40038020))
#define ADC_PSSI_R              (*((reg32_t *)0x40038028))
#define ADC_SAC_R               (*((reg32_t *)0x40038030))
#define ADC_SSMUX0_R            (*((reg32_t *)0x40038040))
#define ADC_SSCTL0_R            (*((reg32_t *)0x40038044))
#define ADC_SSFIFO0_R           (*((reg32_t *)0x40038048))
#define ADC_SSFSTAT0_R          (*((reg32_t *)0x4003804C))
#define ADC_SSMUX1_R            (*((reg32_t *)0x40038060))
#define ADC_SSCTL1_R            (*((reg32_t *)0x40038064))
#define ADC_SSFIFO1_R           (*((reg32_t *)0x40038068))
#define ADC_SSFSTAT1_R          (*((reg32_t *)0x4003806C))
#define ADC_SSMUX2_R            (*((reg32_t *)0x40038080))
#define ADC_SSCTL2_R            (*((reg32_t *)0x40038084))
#define ADC_SSFIFO2_R           (*((reg32_t *)0x40038088))
#define ADC_SSFSTAT2_R          (*((reg32_t *)0x4003808C))
#define ADC_SSMUX3_R            (*((reg32_t *)0x400380A0))
#define ADC_SSCTL3_R            (*((reg32_t *)0x400380A4))
#define ADC_SSFIFO3_R           (*((reg32_t *)0x400380A8))
#define ADC_SSFSTAT3_R          (*((reg32_t *)0x400380AC))
#define ADC_TMLB_R              (*((reg32_t *)0x40038100))
/*\}*/

/**
 * Deprecated defines for the bit fields in the FLASH_FMC register.
 */
/*\{*/
#define FLASH_FMC_WRKEY_M       0xFFFF0000  ///< Flash Memory Write Key
#define FLASH_FMC_WRKEY_S       16
/*\}*/

/**
 * Deprecated defines for the bit fields in the SYSCTL_DID1 register.
 */
/*\{*/
#define SYSCTL_DID1_PKG_28SOIC  0x00000000  ///< SOIC package
#define SYSCTL_DID1_PKG_48QFP   0x00000008  ///< QFP package
/*\}*/

/**
 * Deprecated defines for the NVIC register addresses.
 */
/*\{*/
#define NVIC_MPU_R              (*((reg32_t *)0xE000ED9C))
/*\}*/

#endif /* DEPRECATED */

#endif /* LM3S1968_H */
